{
    "first_para": "Harold Daniel Hope Elletson (born 8 December 1960) is a British politician.", 
    "full": {
        "extract": "Harold Daniel Hope Elletson (born 8 December 1960) is a British politician.\nElletson unsuccessfully contested Burnley for the Conservative Party in the 1987 general election, before becoming Member of Parliament (MP) for Blackpool North in 1992. However, in his 1997 bid for re-election in the new Blackpool North and Fleetwood constituency, he lost to Labour's Joan Humble by 8,946 votes.\nOn 22 December 1996 The Observer newspaper claimed Elletson moonlighted as an MI6 agent: the headline read \"Pro-Serb Tory MP was MI6 Agent\". The newspaper said he was recruited before he entered the House of Commons, working for the intelligence agency in Eastern Europe, the former Soviet Union and during the conflict in the former Yugoslavia:\n\n\"After visiting Yugoslavia in 1992, Mr Elletson notified his MI6 handlers that donations were reaching the Conservative Party from Serbia. MI6 received special sanction from the Prime Minister (John Major) for Mr Elletson to continue his secret role after his election in 1992. He carried out his unpaid intelligence work in Eastern Europe while representing the electors of Blackpool: he also ran an extensive network of private business interests in the region, while using his public position to mount a controversial defence of the Serb regime.\".\n\nHe joined the Liberal Democrats in 2002.\nOn September 30, 2014, as chairman of The Campaign for the North, he launched an all-party pressure group to re-create the ancient kingdom of Northumbria as a federal state in a new United Kingdom. The Campaign seeks ‘devo-max’ power from Westminster to bring the traditional counties of Northumberland, Durham, Yorkshire, Lancashire, Westmorland and Cumberland into a democratic state with powers equal to Scotland, Wales, Northern Ireland or London, retaining membership of the European Union. The proposed Northumbria would cover the territory that was ruled a thousand years ago by the Norseman Erik Bloodaxe, the last ‘king of the North’, killed in battle at Stainmore, in the Pennines in 954.", 
        "ns": 0, 
        "pageid": 5379963, 
        "title": "Harold Elletson"
    }
}