{
    "first_para": "David Wright Miliband (born 15 July 1965) is a British former Labour Party politician who was the Member of Parliament (MP) for South Shields from 2001 to 2013, and was the Secretary of State for Foreign and Commonwealth Affairs from 2007 to 2010. He and his brother, the current Leader of the Labour Party Ed Miliband, were the first siblings to sit in the Cabinet simultaneously since Edward, Lord Stanley, and Oliver Stanley in 1938.", 
    "full": {
        "extract": "David Wright Miliband (born 15 July 1965) is a British former Labour Party politician who was the Member of Parliament (MP) for South Shields from 2001 to 2013, and was the Secretary of State for Foreign and Commonwealth Affairs from 2007 to 2010. He and his brother, the current Leader of the Labour Party Ed Miliband, were the first siblings to sit in the Cabinet simultaneously since Edward, Lord Stanley, and Oliver Stanley in 1938.\nBorn in London, Miliband studied at Oxford University and the Massachusetts Institute of Technology, where he started his career at the Institute for Public Policy Research. Aged 29 he became Tony Blair's Head of Policy whilst the Labour Party was in opposition, and he was a major contributor to Labour's manifesto for the 1997 election, which brought the party to power in a landslide victory. Blair subsequently made him head of the Prime Minister's Policy Unit from 1997 to 2001, at which point Miliband was elected to Parliament for the seat of South Shields.\nMiliband spent the next few years in various junior ministerial posts, including at the Department for Education and Skills, before joining the Cabinet in 2006 as Environment Secretary. His tenure in this post saw climate change consolidated as a priority for policymakers. On the succession of Gordon Brown as Prime Minister in 2007, Miliband was promoted to become Foreign Secretary. At the age of 41, he became the youngest person to hold that office since David Owen 30 years earlier. In September 2010, Miliband narrowly lost the Labour leadership election to his brother Ed. On 29 September 2010, he announced that to avoid \"constant comparison\" with his brother Ed, and because of the \"perpetual, distracting and destructive attempts to find division where there is none, and splits where they don't exist, all to the detriment of the party's cause\", he would not stand for the Shadow Cabinet.\nOn 15 April 2013, Miliband resigned from Parliament in order to take up the posts of President and CEO of the International Rescue Committee in New York City, which triggered a by-election.", 
        "ns": 0, 
        "pageid": 19339264, 
        "title": "David Miliband"
    }
}