{
    "first_para": "Andrew Pakes (born 24 April 1973 as Andrew Stone) is a British Labour Party politician, and a former President of the National Union of Students (NUS).", 
    "full": {
        "extract": "Andrew Pakes (born 24 April 1973 as Andrew Stone) is a British Labour Party politician, and a former President of the National Union of Students (NUS).\nPakes grew up in Newport Pagnell, Milton Keynes, Buckinghamshire. An active member of Labour Students, he was on the national executive of the National Union of Students from 1996-2000 and was twice elected the National President of NUS, serving in the role from 1998-2000. He had previously served as the organisation's National Treasurer from 1997-1998. Pakes was the second openly gay individual to be elected NUS President after Stephen Twigg (who was President from 1990-92).\nAfter his term as NUS President, Pakes worked for the Association of University Teachers (AUT, now part of the University and College Union), and for the then-Deputy Mayor of London, Nicky Gavron. He later worked as a consultant on environmental and transport policy, and served as Chair of the Socialist Environment and Resources Association (SERA, a Labour-linked environmental campaign) and as a member of the Labour Party's National Policy Forum, representing the affiliated socialist societies. He was a Councillor in the London Borough of Southwark from 2006 to 2010, standing down in that year to contest the Milton Keynes North parliamentary seat.\nPakes stood as the Labour and Co-operative parliamentary candidate in the constituency of Milton Keynes North at the 2010 general election, where he was defeated by the Conservative Party candidate Mark Lancaster on a swing of 9.2%. This was one of the largest swings from Labour to the Conservatives recorded in the United Kingdom during the 2010 General Election.\nIn 2011, Pakes was selected to become Labour's Prospective Parliamentary Candidate for Milton Keynes South, for the next general election.\nHe is a special adviser to Mary Creagh, working with the shadow DEFRA team.", 
        "ns": 0, 
        "pageid": 17354580, 
        "title": "Andrew Pakes"
    }
}