{
    "first_para": "Charles Peter Kennedy (born 25 November 1959) is a British Liberal Democrat politician, who led the Liberal Democrats from 9 August 1999 until 7 January 2006 and is currently a member of parliament (MP) for the Ross, Skye and Lochaber constituency.", 
    "full": {
        "extract": "Charles Peter Kennedy (born 25 November 1959) is a British Liberal Democrat politician, who led the Liberal Democrats from 9 August 1999 until 7 January 2006 and is currently a member of parliament (MP) for the Ross, Skye and Lochaber constituency.\nIn the 1983 general election, he stood for the Ross, Cromarty & Skye constituency, then held by the Conservative MP and Minister, Hamish Gray. In a shocking result, Kennedy was elected for the Social Democratic Party (SDP), making him at 23, the youngest MP in the House of Commons. Ambitious and popular, he quickly emerged as a potential party leader. In 1994, after the SDP and Liberal Party had merged, he became President of the Liberal Democrats, a position he held for the next four years. In 1999, after the resignation of Paddy Ashdown, Kennedy was elected party leader.\nHe took the party through two general elections, during which time they increased their seats in the House of Commons from 46 to 62. However, he faced criticism for his laid-back leadership style, and there was considerable speculation regarding his alcohol consumption. From December 2005, some within the party were questioning his leadership and calling for a leadership election. On 5 January 2006, Kennedy was informed that ITN would be reporting that he had received treatment for a drinking problem. Kennedy decided to pre-empt the broadcast and admit his condition openly. He called a leadership election at the same time, stating that he intended to stand. The admission of a drinking problem had seriously damaged his standing and twenty-five MPs (nineteen of whom were front bench MPs) signed a statement urging him to resign immediately. As support for him ebbed away, Kennedy resigned as leader on 7 January, saying that he would not be standing in the leadership election. Deputy leader Sir Menzies Campbell took over as interim leader and was elected as leader on 2 March 2006.", 
        "ns": 0, 
        "pageid": 26598741, 
        "title": "Charles Kennedy"
    }
}