{
    "first_para": "Dame Margaret Mary Beckett, DBE (born 15 January 1943) is a British Labour Party politician who has been the Member of Parliament (MP) for Derby South since 1983. She was the Deputy Leader of the Labour Party under John Smith 1992 to 1994, and briefly served as Leader of the Labour Party following Smith's sudden death. She later served in the Cabinet under Prime Minister Tony Blair in a number of roles, most notably becoming Britain's first ever female Foreign Secretary in 2006.", 
    "full": {
        "extract": "Dame Margaret Mary Beckett, DBE (born 15 January 1943) is a British Labour Party politician who has been the Member of Parliament (MP) for Derby South since 1983. She was the Deputy Leader of the Labour Party under John Smith 1992 to 1994, and briefly served as Leader of the Labour Party following Smith's sudden death. She later served in the Cabinet under Prime Minister Tony Blair in a number of roles, most notably becoming Britain's first ever female Foreign Secretary in 2006.\nBeckett was first elected to Parliament in 1974 for Lincoln and held junior positions in the governments of Harold Wilson and James Callaghan. She lost her seat in 1979, but returned to the House of Commons in 1983, this time representing Derby South. She was appointed to Neil Kinnock's Shadow Cabinet shortly afterwards, ultimately being elected Deputy Leader of the Labour Party in 1992, becoming the first woman ever to hold that role. Following the premature death of John Smith in 1994, she also technically became the first woman to lead the Labour Party, although Tony Blair won the election to replace Smith shortly afterwards to assume the substantive leadership.\nAfter Labour's victory in 1997, Beckett became a member of Tony Blair's Cabinet initially as the President of the Board of Trade. She was later the Leader of the House of Commons and Secretary of State for Environment, Food and Rural Affairs, before in 2006 becoming Foreign Secretary, making her the first woman to hold that position, and—after Margaret Thatcher—the second woman to hold one of the Great Offices of State. After Blair resigned as Prime Minister in 2007, Beckett was not initially given a position by new Prime Minister Gordon Brown. After some time, Brown appointed her Minister of State for Housing and Planning in 2008, before she left the government for the final time in 2009.\nShe was the longest-serving female MP in the House of Commons up until Parliament was dissolved in preparation for the UK General Election of 2015, as well as being one of the longest-serving ministers in government history. She is currently a candidate for the Derby South constituency and is expected to be returned as MP for the area after the election. If that happens, she will return to being one of the few remaining MPs who served in the Labour governments of the 1970s. She was appointed a Dame Commander of the Order of the British Empire in the 2013 New Year Honours for public and political service.", 
        "ns": 0, 
        "pageid": 224819, 
        "title": "Margaret Beckett"
    }
}