{
    "first_para": "Máirtín Ó Muilleoir (born 1 January 1959, as Martin Miller) is an Irish Sinn Féin politician, author and businessman, who served as the 58th Lord Mayor of Belfast for the 2013/2014 year.", 
    "full": {
        "extract": "Máirtín Ó Muilleoir (born 1 January 1959, as Martin Miller) is an Irish Sinn Féin politician, author and businessman, who served as the 58th Lord Mayor of Belfast for the 2013/2014 year.\nA graduate of Queen's University Belfast, Ó Muilleoir entered politics in 1985, when he stood as a Sinn Féin candidate for the Upper Falls area, finishing as runner-up to Alliance Party councillor Pip Glendinning. When Glendinning resigned her seat two years later, Ó Muilleoir won the resulting by-election in October 1987. During his time on the council, he started a number of legal actions against what he saw as discrimination by the Unionist dominated council, detailing these experiences in a subsequent book, The Dome of Delight. He was re-elected at the 1989 and 1993 local elections, retiring at the 1997 local elections to concentrate on his business career.\nIn 1997, he became part-owner of the Andersonstown News, which subsequently developed the New York based Irish Echo. A fluent Irish speaker, he also has interests in other Irish and American businesses. He also served as a temporary director of Northern Ireland Water.\nHe re-entered politics in 2011, when he was elected as a Belfast city Councillor for the Balmoral area of South Belfast, gaining the seat previously held by Jim Kirkpatrick of the Democratic Unionist Party, and was elected Mayor in June 2013. In 2014, he was co-opted as an MLA into the Northern Ireland Assembly. He is standing in Belfast South at the 2015 United Kingdom general election.\n^ a b c \"Mairtin O Muilleoir is Belfast's new Lord Mayor\". The News Letter. 3 June 2013. Retrieved 2013-06-21. \n^ a b c d e \"Mairtin O Muilleoir - a republican for change\". The Belfast Telegraph. 8 June 2013. Retrieved 2013-06-21. \n^ Belfast city council election results 1985-1989, ARK, accessed 21 June 2013\n^ \"Mairtin O'Muilleoir to represent SF in south Belfast\". BBC. 6 December 2010. Retrieved 2013-06-21. \n^ Balmoral election results, 1993-2011, ARK, accessed 21 June 2013\n^ http://www.belfasttelegraph.co.uk/news/northern-ireland/sinn-feins-mairtin-o-muilleoir-sets-sights-on-sdlps-belfast-seat-30686234.html", 
        "ns": 0, 
        "pageid": 39737890, 
        "title": "Máirtín Ó Muilleoir"
    }
}