{
    "first_para": "Jimmy Spratt is a Unionist politician from Northern Ireland.", 
    "full": {
        "extract": "Jimmy Spratt is a Unionist politician from Northern Ireland.\nIn 2007, he was elected as a Democratic Unionist Party member of the Northern Ireland Assembly for South Belfast. He chairs the Assembly and Executive Review Committee, is one of the DUP representatives on the Northern Ireland Policing Board and is a member of Castlereagh Council. He stood for the Belfast South constituency at the Westminster 2005 general election but lost narrowly to the SDLP's Alasdair McDonnell.\nJimmy Spratt is a former Royal Ulster Constabulary (RUC) officer who joined in 1972 and served for 30 years in Derry and Belfast. He worked for the Close Protection Unit including as Primary Protection Officer and was attached to a former Secretary of State, NIO Ministers, the RUC Chief Constable and other VIPs.\nHe was heavily involved in the Police Federation for Northern Ireland and acted as Chairman until his retirement. Spratt also served on Government Committees at regional and national level representing the British Police Service and has served on the Home Office Working Group for Health and Safety and Police Negotiating Board for pay and conditions across the UK.\nHe is an political member of the Castlereagh Policing and Community Safety Partnership. Spratt is an assistant secretary of his local Presbyterian church.\nWhen the chief executive of Translink was criticised for not appearing before Stormont's regional development committee, Spratt said that he did not think it was \"a hardship for someone on £200,000\" to appear before it and \"explain what's going on\".  Mr. Spratt has made uncomplimentary and impolitic comments regarding cyclists  and called those who objected to the proposals for the Maze 'nutters' which he denied until Hansard was published  and he was obliged to apologise.\nHe has been married for over thirty years, with four grown-up sons.\n^ [1]\n^ http://www.niassembly.gov.uk/assem_exec/2007mandate/assem_exec.htm\n^ http://www.nipolicingboard.org.uk/index/theboard/member.htm?id=8856\n^ http://www.castlereagh.gov.uk/south4.asp\n^ [2]\n^ DUP.org.uk\n^ \"BBC News - Translink chief criticised over absence from Stormont committee\". BBC News. BBC News.   \n^ [3]\n^ [4]\n^ [5]", 
        "ns": 0, 
        "pageid": 9936281, 
        "title": "Jimmy Spratt"
    }
}