{
    "first_para": "Dr Sarah Wollaston (born 17 February 1962) is a British Conservative Party politician. Wollaston studied at King's College London School of Medicine, and after graduation was a general practitioner for two decades. Before becoming the Member of Parliament (MP) for Totnes in 2010, she was the first person to be selected as a parliamentary candidate for a major British political party through an open primary, in which she emphasised that she was an outsider to politics, who had worked a 'real job'. She won the nomination for the Conservative candidature and at the general election won the seat with an increased Conservative majority.", 
    "full": {
        "extract": "Dr Sarah Wollaston (born 17 February 1962) is a British Conservative Party politician. Wollaston studied at King's College London School of Medicine, and after graduation was a general practitioner for two decades. Before becoming the Member of Parliament (MP) for Totnes in 2010, she was the first person to be selected as a parliamentary candidate for a major British political party through an open primary, in which she emphasised that she was an outsider to politics, who had worked a 'real job'. She won the nomination for the Conservative candidature and at the general election won the seat with an increased Conservative majority.\nWollaston is Chair of the Health Select Committee, having joined the Committee following her election to the House of Commons and later winning election to the Chair in 2014. She has gained a reputation for being an independent-minded MP, not afraid to stand up to her party's leadership or oppose them when she believes that their decisions go against the interests of her constituents.\nAs such, she has rebelled against the Government on several key votes - voting in favour of a referendum on Britain's membership of the European Union in 2011, for a cut in the EU budget in 2011 and voting against military intervention in Syria in 2013. She has been a vocal proponent for minimum unit pricing for alcohol and has spoken out against political patronage in Westminster. In 2013, she jointly won The Spectator Parliamentarian of the Year Award for her opposition to a Royal Charter on press regulation.", 
        "ns": 0, 
        "pageid": 23864436, 
        "title": "Sarah Wollaston"
    }
}