{
    "first_para": "Alexander Elliot Anderson Salmond (/ˈsæmənd/; born 31 December 1954) is a Scottish politician who served as the fourth First Minister of Scotland from 2007 to 2014. He was the leader of the Scottish National Party (SNP) for over twenty years, having served for two terms, firstly from 1990 to 2000 and subsequently from 2004 to 2014.", 
    "full": {
        "extract": "Alexander Elliot Anderson Salmond (/ˈsæmənd/; born 31 December 1954) is a Scottish politician who served as the fourth First Minister of Scotland from 2007 to 2014. He was the leader of the Scottish National Party (SNP) for over twenty years, having served for two terms, firstly from 1990 to 2000 and subsequently from 2004 to 2014.\nHe has been the Member of the Scottish Parliament (MSP) for Aberdeenshire East since 2007 (known as Gordon from 2007 to 2011), having previously served as the MSP for Banff and Buchan from 1999 to 2001. From 1987 to 2010 he served as Member of Parliament for Banff and Buchan in the House of Commons of the United Kingdom.\nFollowing the establishment of the devolved Scottish Parliament in 1999, he simultaneously represented Banff and Buchan as both Member of Parliament (MP) and MSP for three years. Salmond resigned as SNP leader in 2000 and did not seek re-election to the Scottish Parliament. He did however retain his Westminster seat in the 2001 general election. Salmond was once again elected SNP leader in 2004 and the following year held his Banff and Buchan seat in the 2005 general election. In 2006 he announced his intention to contest Gordon in the 2007 Scottish Parliament election, an election in which Salmond defeated the incumbent MSP and in which nationally, the SNP emerged as the largest single party. After the SNP secured confidence and supply support from the Scottish Green Party, Salmond was voted First Minister by the Scottish Parliament on 16 May 2007. During his first term, he headed a minority Scottish Government. At the 2011 Scottish Parliament election the SNP won with an overall majority, a feat initially thought impossible under the additional member system used in elections for the Scottish Parliament.\nPolitically, Salmond is one of the foremost proponents of Scottish independence, repeatedly calling for a referendum on the issue. Salmond has campaigned on global warming and in government has committed Scotland to legislation on emission reduction and the generation of renewable energy. The day after the 2014 independence referendum, at which a majority of the Scottish people voted to remain as part of the United Kingdom, Salmond announced his intention not to stand for re-election as leader of the SNP at the SNP National Conference in November, and to resign as First Minister thereafter. He was succeeded as SNP leader by his deputy, Nicola Sturgeon, as she was the only candidate to stand for the leadership election. He submitted his resignation as First Minister on 18 November, and was succeeded by Sturgeon the following day.", 
        "ns": 0, 
        "pageid": 21234593, 
        "title": "Alex Salmond"
    }
}