{
    "first_para": "Denis MacShane (born Josef Denis Matyjaszek; 21 May 1948) is a British former Labour Party politician and a convicted fraudster. He was the Member of Parliament (MP) for Rotherham from 1994 to his resignation in 2012 and served in the Labour Government as Minister of State for Europe from 2002 until 2005.", 
    "full": {
        "extract": "Denis MacShane (born Josef Denis Matyjaszek; 21 May 1948) is a British former Labour Party politician and a convicted fraudster. He was the Member of Parliament (MP) for Rotherham from 1994 to his resignation in 2012 and served in the Labour Government as Minister of State for Europe from 2002 until 2005.\nOn 2 November 2012, he was suspended from the Labour Party after the House of Commons Standards and Privileges Committee found that he had submitted 19 false invoices \"plainly intended to deceive\" the parliamentary expenses authority. Later that day he announced his intention to resign as MP for Rotherham.\nOn 9 October 2013, MacShane was removed from the Privy Council (and so lost the right to use the honorific 'The Right Honourable'). On 18 November 2013 he pleaded guilty to false accounting at the Old Bailey, by submitting false receipts for £12,900, and on 23 December 2013, he was sentenced to six months imprisonment. He served his sentence in HM Prison Belmarsh and HM Prison Brixton.\n^ \"Rt Hon Denis MacShane\". House of Commons. Archived from the original on 20 January 2012. \n^ \"MP's expenses: Denis MacShane resigns over false invoices\". BBC. 2 November 2012. Retrieved 2 November 2012. \n^ Standards and Privileges Committee (2 November 2012). Second Report – Mr Denis MacShane (Report). UK Parliament. Retrieved 2 November 2012. \n^ \"Denis MacShane Resigns\". DenisMacShane.com. 2 November 2012. Retrieved 2 November 2012. \n^ \n^ \n^ \n^ \"Prison Diaries review – Denis MacShane's account of life behind bars\". The Guardian. Retrieved 15 March 2015.", 
        "ns": 0, 
        "pageid": 417475, 
        "title": "Denis MacShane"
    }
}