{
    "first_para": "John van Weenen OMT MBE (born August 26, 1941, Enfield, Middlesex) is an 8th Dan karateka and humanitarian.", 
    "full": {
        "extract": "John van Weenen OMT MBE (born August 26, 1941, Enfield, Middlesex) is an 8th Dan karateka and humanitarian.\nVan Weenen was graded to 1st Dan by Moss Hollis in 1966,(his diploma is reproduced in his auto biography 'In Funakoshi's Footsteps'), before travelling to Japan in 1967 to train at the invitation of Masutatsu Oyama at the Kyokushinkai Headquarters.In fact, John decided to train under Hirokazu Kanazawa and registered at the JKA Honbu in Tokyo.\nHe started the Traditional Association of Shotokan Karate (TASK) in Bedford, Bedfordshire, whose guest instructors included Bob Poynton, Ticky Donovan and Sean Roberts.\nVan Weenen is the Executive Director of Task Force Albania, a humanitarian organisation that has provided over £7 million in aid to Albania since the end of communism in the country in 1991. In 1993, he was the first person to receive the Order of Mother Teresa in Albania for his work, and this was re-presented by Mother Teresa herself in Calcutta. In 1999, he was awarded the MBE by Prince Charles and the citation read: 'For services to the children of Albania'\nLater that year he established the British Children's Library network, and in November the first library was inaugurated in Tirana, Albania's Capital.. It was opened by Charles, Earl Spencer in honour of his late sister, Diana, Princess of Wales. A second library was opened in 2001, in Durrës, by Sir Norman Wisdom.\nProfessor Dr Sali Berisha, Prime Minister of Albania, said that Van Weenen “quite uniquely, turned his martial arts expertise into missionary skills.” In 2001, Berisha was a guest on an episode of This Is Your Life, dedicated to Van Weenen. Other guests included Charles Spencer and Anila Bido. Berisha would later request that Van Weenen become the Honorary Consul in Great Britain for Albania He took up this position in 2012.", 
        "ns": 0, 
        "pageid": 25198696, 
        "title": "John van Weenen"
    }
}