{
    "first_para": "Anthony Joseph Lloyd (born 25 February 1950) is a British Labour Party politician and the inaugural Greater Manchester Police and Crime Commissioner.", 
    "full": {
        "extract": "Anthony Joseph Lloyd (born 25 February 1950) is a British Labour Party politician and the inaugural Greater Manchester Police and Crime Commissioner.\nBorn in Stretford, Lloyd served as a Trafford councillor from 1979 to 1984. In 1983, Lloyd was elected Member of Parliament (MP) for Stretford, representing the constituency until 1997, when the Manchester Central seat was created. As an MP, Lloyd was an opposition spokesman between 1987 and 1997, a Minister of State in the Foreign and Commonwealth Office between 1997 and 1999 and Chair of the Parliamentary Labour Party from 2006 to 2012. Lloyd continued as a constituency MP until October 2012, when he stepped down to contest the 2012 Police and Crime Commissioner elections in the Greater Manchester Police area. He was elected and assumed the position in November 2012.\nIn 2011, the Manchester Evening News listed Lloyd among its 250 of the Most Influential People in Greater Manchester, describing him as \"a major figure on Labour politics in Greater Manchester\", and introduced him as \"the most powerful man in Greater Manchester\" on his victory as the region's inaugural Police and Crime Commissioner in 2012. In a directory of MPs produced by The Guardian, Andrew Roth described Lloyd as a \"well informed, thoughtful and realistic regionalist and internationalist\".\n^ a b c \"Anthony Joseph Lloyd\". politics.co.uk. Retrieved 2012-11-16. \n^ a b c Dilworth & Stuart-Jones 2012.\n^ a b \"Tony Lloyd: Electoral history and profile\". The Guardian. guardian.co.uk. Retrieved 2012-11-20. \n^ a b \"Introducing new police commissioner Tony Lloyd - the most powerful man in Greater Manchester?\". Manchester Evening News. menmedia.co.uk. 2012-11-16. Retrieved 2012-11-20. \n^ Jupp 2012, p. 41.", 
        "ns": 0, 
        "pageid": 428653, 
        "title": "Tony Lloyd"
    }
}