{
    "first_para": "Thomas Anthony John \"Tom\" Rubython (born 1955) is a British journalist, entrepreneur and publisher with an interest in business topics and Formula One racing. He was formerly the founder and publisher of Formula 1 Magazine, BusinessF1 Magazine and editor of EuroBusiness magazine. He has written a number of books including a collaboration to publish a 2004 biography of Ayrton Senna, The Life of Senna.", 
    "full": {
        "extract": "Thomas Anthony John \"Tom\" Rubython (born 1955) is a British journalist, entrepreneur and publisher with an interest in business topics and Formula One racing. He was formerly the founder and publisher of Formula 1 Magazine, BusinessF1 Magazine and editor of EuroBusiness magazine. He has written a number of books including a collaboration to publish a 2004 biography of Ayrton Senna, The Life of Senna.\nRubython lost a libel suit before the UK High Court in 2006 and was ordered to pay damages of £75,000. He appealed against this award but lost in the UK Court of Appeal on 18 April 2007. In June 2006, he faced another libel suit, this time from FIA director of publicity Richard Woods which Woods won. In March 2007, Rubython, by this time using the name 'Batman Rubython', or Bat for short, in turn, won a libel action against Woods.\nIn the 1990s, Rubython was the owner, publisher and editor of Business Age magazine, which he sold to Dutch publishing giant VNU for close to £3 million. His next venture was Sunday Business newspaper, a more ambitious project that he hoped would exploit a gap in the market left vacant by the Financial Times. However, it foundered almost from the very beginning due to a lack of investment, combined with an increase in business coverage by the existing Sunday newspapers. Although it achieved a circulation of 155,000 in its first week, this dropped within months to fewer than 40,000. Rubython was forced out soon afterwards although he continued to write for the newspaper. The holding company went into administration twice before the venture was sold to the Barclay Brothers.\nHe was editor-in-chief of SportsPro Magazine, but has since been replaced by David Cushnan in August 2008.\nHe was the UK Independence Party prospective parliamentary candidate for South Dorset at the 2015 General Election but withdrew.", 
        "ns": 0, 
        "pageid": 3638532, 
        "title": "Tom Rubython"
    }
}