{
    "first_para": "Michael Kevin Moore (born 3 June 1965) is a British Liberal Democrat politician who has been returned on two occasions to serve as Member of Parliament (MP) for the constituency of Berwickshire, Roxburgh and Selkirk, and was returned on two earlier occasions as MP for the previous constituency of Tweeddale, Ettrick and Lauderdale. He is currently standing for a further term in the United Kingdom general election, 2015.", 
    "full": {
        "extract": "Michael Kevin Moore (born 3 June 1965) is a British Liberal Democrat politician who has been returned on two occasions to serve as Member of Parliament (MP) for the constituency of Berwickshire, Roxburgh and Selkirk, and was returned on two earlier occasions as MP for the previous constituency of Tweeddale, Ettrick and Lauderdale. He is currently standing for a further term in the United Kingdom general election, 2015.\nBorn in Northern Ireland, but largely raised in Scotland, he qualified as a chartered accountant and worked as a researcher to the prominent Liberal Democrat politician, David Steel. At the 1997 general election, Moore succeeded Steel as the Liberal Democrat MP for the Scottish Borders constituency of Tweeddale, Ettrick and Lauderdale (Berwickshire, Roxburgh & Selkirk from 2005). He joined the Liberal Democrat Frontbench Team in 2005, and held many portfolios, including Defence, Foreign Affairs, International Development and Northern Ireland & Scotland (joint).\nFollowing the 2010 general election, and the formation of the Conservative-Liberal Democrat coalition, the cabinet post of Scottish Secretary was given to the Liberal Democrats, initially Danny Alexander. However following the resignation of Chief Secretary to the Treasury David Laws a month later, Alexander took his role, and Moore was appointed the Scottish Secretary on 29 May 2010. Since entering office, Moore has overseen the implementation of the Scotland Act 2012, which grants further devolution to Scotland. He was removed from the post in a Cabinet reshuffle in October 2013.", 
        "ns": 0, 
        "pageid": 427588, 
        "title": "Michael Moore (British politician)"
    }
}