{
    "first_para": "Nadine Vanessa Dorries (née Bargery; born 21 May 1957) is the Conservative Member of Parliament (MP) for Mid Bedfordshire, a seat she has held since the 2005 general election.", 
    "full": {
        "extract": "Nadine Vanessa Dorries (née Bargery; born 21 May 1957) is the Conservative Member of Parliament (MP) for Mid Bedfordshire, a seat she has held since the 2005 general election.\nDorries was born into a working-class family in Liverpool, England. She was originally a nurse and subsequently became a medical representative. During her early career she spent a year in Zambia as the head of a community school. After returning to the UK she founded Company Kids Ltd, which provided child day-care services for working parents. The company was sold in 1998.\nDorries was elected to the House of Commons at the 2005 general election for the safe seat of Mid-Bedfordshire, with a majority of 11,355. Since first taking her seat, Dorries has introduced several unsuccessful Private Member's Bills in the House of Commons, including attempts to reduce the time limit for abortion in Great Britain, to change the rules regarding the counselling of the women involved and the advocacy of sexual abstinence for girls in sex education. She is also an opponent of the current Speaker of the House of Commons John Bercow, and has attempted to have him removed from the post. She has clashed too with her party leader, Prime Minister David Cameron, and described Cameron and chancellor George Osborne as \"two arrogant posh boys\". In 2008 Dorries won The Spectator magazine's Reader's Representative Award, and in 2012 she was voted best MP on Twitter by the politics.co.uk website.\nOn 6 November 2012, she was suspended from the parliamentary Conservative Party owing to her decision to take part in I'm a Celebrity...Get Me Out of Here! without informing the Chief Whip. The Party whip was returned to Dorries on 8 May 2013. She was re-admitted to the parliamentary party during the following May.\nDorries, a right-wing Conservative, has sometimes been described as \"Mad Nad\" in the media. Journalist Quentin Letts has accused other MPs of feeling \"envy\" for her flamboyance and publicity skills while in 2012 Channel 4 News presenter Cathy Newman wrote about \"how she stands out in Parliament – a tropical bird in amongst all that dull, grey, plumage on the Commons benches.\" In 2013 Adrian Hilton wrote that Dorries \"radiates the sort of plain-speaking, unstuffy approachability which is rapidly becoming rather attractive to the disaffected and disillusioned masses\".", 
        "ns": 0, 
        "pageid": 1872870, 
        "title": "Nadine Dorries"
    }
}