{
    "first_para": "Sir Malcolm Leslie Rifkind, KCMG, QC, (born 21 June 1946) is a British politician and former Member of Parliament (MP) for Kensington, and since February 2015 has been suspended from the Conservative Party. He served in various roles as a cabinet minister under Prime Ministers Margaret Thatcher and John Major, including Secretary of State for Scotland (1986–1990), Defence Secretary (1992–1995) and Foreign Secretary (1995–1997).", 
    "full": {
        "extract": "Sir Malcolm Leslie Rifkind, KCMG, QC, (born 21 June 1946) is a British politician and former Member of Parliament (MP) for Kensington, and since February 2015 has been suspended from the Conservative Party. He served in various roles as a cabinet minister under Prime Ministers Margaret Thatcher and John Major, including Secretary of State for Scotland (1986–1990), Defence Secretary (1992–1995) and Foreign Secretary (1995–1997).\nRifkind was the MP for Edinburgh Pentlands from 1974 to 1997. In 1997, his party lost power and he lost his seat to the Labour Party. He attempted - unsuccessfully - to be re-elected in Pentlands in 2001; the constituency was abolished before the 2005 general election and he was adopted, and subsequently elected, as the Conservative candidate for Kensington and Chelsea. He announced his intention to seek the leadership of the party before the 2005 Conservative Party leadership election, but withdrew before balloting commenced. He became Chairman of the Standards and Privileges Committee of the House of Commons during the 2005–2010 parliament.\nRifkind stood for the Kensington seat and was elected at the 2010 general election with a majority of 8,616 votes. He was appointed chairman of the Intelligence and Security Committee by the Prime Minister, David Cameron, on 6 July 2010. Rifkind is an advocate for British military intervention in the Syrian Civil War, with or without a mandate from the United Nations. In 2014 he was appointed Chairman of the World Economic Forum's Nuclear Security Council. In January 2015 he was appointed by the OSCE as a member of their Eminent Persons Panel on European Security.\nSir Malcolm is Co-Vice Chair of the Global Panel Foundation - America - with Dr. Dov S. Zakheim, the former U.S Under-Secretary of Defense and Comptroller of the Armed Forces. The Chair is former Canadian External Affairs and Minister of State for Finance Barbara McDougall.", 
        "ns": 0, 
        "pageid": 354551, 
        "title": "Malcolm Rifkind"
    }
}