{
    "first_para": "Nicholas William Peter \"Nick\" Clegg (born 7 January 1967) is a British politician who since 2010 has been Deputy Prime Minister of the United Kingdom and Lord President of the Council (with special responsibility for political and constitutional reform), as part of the coalition government headed by Prime Minister David Cameron. Clegg has been the leader of the Liberal Democrats since 2007, and a member of parliament (MP) representing Sheffield Hallam since 2005. Having attended the University of Cambridge, the University of Minnesota, and the College of Europe, he was previously a Member of the European Parliament (MEP) and an award-winning journalist for the Financial Times.", 
    "full": {
        "extract": "Nicholas William Peter \"Nick\" Clegg (born 7 January 1967) is a British politician who since 2010 has been Deputy Prime Minister of the United Kingdom and Lord President of the Council (with special responsibility for political and constitutional reform), as part of the coalition government headed by Prime Minister David Cameron. Clegg has been the leader of the Liberal Democrats since 2007, and a member of parliament (MP) representing Sheffield Hallam since 2005. Having attended the University of Cambridge, the University of Minnesota, and the College of Europe, he was previously a Member of the European Parliament (MEP) and an award-winning journalist for the Financial Times.\nClegg was elected to the House of Commons at the 2005 general election and became the Liberal Democrats' Home Affairs spokesperson in 2006. He became Deputy Prime Minister following the 2010 general election, when the Liberal Democrats formed a coalition government with the Conservative Party. As well as his parliamentary roles, Clegg has contributed to many pamphlets and books on political issues. Clegg is a fluent speaker of five European languages. Before entering politics he was a journalist, lecturer, political consultant, and an adviser to Leon Brittan.", 
        "ns": 0, 
        "pageid": 728093, 
        "title": "Nick Clegg"
    }
}