{
    "first_para": "Michael McCann (born 2 January 1964) is a British Labour Party politician who has been the Member of Parliament (MP) for East Kilbride, Strathaven and Lesmahagow since 2010, succeeding Adam Ingram.", 
    "full": {
        "extract": "Michael McCann (born 2 January 1964) is a British Labour Party politician who has been the Member of Parliament (MP) for East Kilbride, Strathaven and Lesmahagow since 2010, succeeding Adam Ingram.\nMcCann is chairman of the Scottish Parliamentary Labour Party He served on the International Development Committee in the 2010-2015 Parliament\nIn February 2011, the BBC Scotland News investigated allegations surrounding a relationship between McCann and James Kean, a local property developer and Labour Party donor. Mr McCann did not declare a relationship whilst he was a councillor, serving on the planning and estates committees in South Lanarkshire. During Mr McCann's tenure numerous applications related to Mr Kean came before committee. It was also alleged that the Labour MP intervened vigorously in a dispute between Mr Kean and a rival bidder over a supermarket application that stood to earn the victor around £18 million. The bid involving Mr Kean’s company, Kean Properties, was eventually granted planning permission in October 2010. McKean argued the rumours were \"outrageous smears\", and said an independent report he had commissioned had concluded that all had been \"dealt following the correct procedures and there is no indication of any preferential treatment or maladministration.\"\nMcCann was charged with breach of the peace and reported to the Procurator Fiscal on 7th October 2014 over an alleged confrontation with a 17-year-old boy and his friend as the pair campaigned for Yes Scotland in his East Kilbride constituency.  McCann filed counter charges. Prior to the incident, McCann had described the referendum debate as “gutter” level and spoke of the “scandalous” personal attacks against him.\nMcCann's relationship with his local constituency activists has become increasingly strained and difficult, to the extent that in February 2015, Labour Party councillors Susan Kerr and Gerry Convery stated that they would not campaign for McCann in May's General Election. Party insiders say McCann and his predecessor as MP for the area, Adam Ingram, are the power-brokers in the local party but are deeply unpopular with members who dislike their abrasive style.\nMcCann is known to be a fierce critic of the SNP, and ruled out any formal post-election deal with them in March 2015", 
        "ns": 0, 
        "pageid": 27315017, 
        "title": "Michael McCann (politician)"
    }
}