{
    "first_para": "Robert David Griffiths (born 1952) is the general secretary of the Communist Party of Britain (CPB). He was elected by the CPB's Executive Committee in January 1998, in place of Mike Hicks.", 
    "full": {
        "extract": "Robert David Griffiths (born 1952) is the general secretary of the Communist Party of Britain (CPB). He was elected by the CPB's Executive Committee in January 1998, in place of Mike Hicks.\nGriffiths was born in Cardiff where he attended Bryn Hafod primary school and Cardiff High School. Employed as Plaid Cymru research officer from 1974 until 1979, he published Socialism for the Welsh People with Gareth Miles in July 1979. In January 1980 he was involved in founding the Welsh Socialist Republican Movement and wrote for the movement's magazine 'the Arrow' (Welsh: Y Saeth). He has also previously served as Welsh president of the AUEW-TASS union.\nGriffiths was a speaker at the first Communist University in Wales, and he speaks regularly at national Communist Party events. He has also taken part in debates at the Oxford Union, Cambridge Union Society and Manchester Debating Union.\nIn February 2013, Griffiths was among those who gave their support to the People's Assembly in a letter published by The Guardian newspaper. He continues to be an active supporter of the People's Assembly nationally and is also active in his local People's Assembly in Cardiff.\n^ \"Robert David Griffiths\". YourNextMP. 2015. \n^ \"The Political Situation in Britain\". New Worker. New Communist Party of Britain. April 1988. Archived from the original on 13 February 2013. \n^ Clement, Barrie (22 February 1988). \"'Star' strike marks Marx anniversary\". the Independent. Archived from the original on 4 November 2012. \n^ \"For a people's MP\". Election Leaflets. Cardiff. 17 April 2010. \n^ Madyn. \"Sosialaeth i'r Cymry\". Gweriniaeth y Gweithiwr (in Welsh). Retrieved 28 November 2013. \n^ Mann, Steve (April 1980). \"Review of Gareth Miles and Robert Griffiths' Socialism for the Welsh People\". Socialist Challenge. Archived from the original on 25 June 2013. \n^ a b Ellis, Peter (1985). the Celtic revolution: a study in anti-imperialism. Talybont: Y Lolfa. pp. 93–95. ISBN 9780862430962. OL 1812565W. \n^ Tim Richards WSRM / Cymru Goch (video). 24 September 2014. 3 minutes in. \n^ Dominic, MacAskill. \"the Communist Party Election Site\". Welsh Communist Party. Archived from the original on 20 November 2008. \n^ Don't dream the American Dream (video). Oxford Union. 1 March 2013. \n^ \"Oxford Union debate rejects the American Dream\". 21centurymanifesto. 24 January 2013. Archived from the original on 24 October 2013. \n^ Socialism does work (video). Oxford Union. 28 November 2013. \n^ This House Believes Capitalism Has Failed (video). Cambridge Union Society. 4 October 2012. \n^ \"Cambridge Union debate\". Cambridge Communists. 9 October 2012. Archived from the original on 15 October 2013. \n^ Taylor, Millia (11 October 2013). \"Never take financial advice from someone who has less money than you\". the Tab Manchester. Archived from the original on 15 October 2013. \n^ \"People's Assembly Against Austerity opening letter\". the Guardian. 5 February 2013. p. 33.", 
        "ns": 0, 
        "pageid": 1845044, 
        "title": "Robert Griffiths (politician)"
    }
}