{
    "first_para": "Nicholas Douglas Palmer (born 5 February 1950, London) is a British Labour Party politician. He was the Member of Parliament (MP) for Broxtowe in Nottinghamshire from 1997 until he lost the seat at the 2010 general election to Conservative Anna Soubry, by 390 votes.", 
    "full": {
        "extract": "Nicholas Douglas Palmer (born 5 February 1950, London) is a British Labour Party politician. He was the Member of Parliament (MP) for Broxtowe in Nottinghamshire from 1997 until he lost the seat at the 2010 general election to Conservative Anna Soubry, by 390 votes.\nDescribed by Andrew Roth as \"quietly effective\", he was Parliamentary Private Secretary (PPS) to the Minister of State, Margaret Beckett, in the Department for Environment, Food and Rural Affairs until April 2005. He then became PPS to the Minister of State, Malcolm Wicks, first in the Department of Trade and Industry, and later in the Department for Business, Enterprise and Regulatory Reform until Wicks stood down in October 2008.\nHe is fond of animals, keeps several pets and is the patron of his favourite charity, Cats Protection. In August 2010, pursuing his interest in animals, he joined the British Union for the Abolition of Vivisection as their Director of International and Corporate Relations. He remains the spokesperson for Broxtowe Labour Party and is the party's candidate to fight the seat at the next general election.\n^ Roth, Andrew (1997). New MPs of '97. Parliamentary Profiles. ISBN 0-900582-38-3. \n^ Andrew Roth. \"Nick Palmer: Electoral history and profile\". The Guardian (London: GuardianNewspapers). Retrieved 20 April 2010. \n^ a b TheyWorkForYou.com \"Nick Palmer Former Labour MP for Broxtowe\". Retrieved 17 April 2010. \n^ \n^ \"Former MP Nick Palmer joins fight against animal testing with new role\", This is Nottingham, 16 September 2010 \n^ Nick Palmer's Newsletters, Welcome to Stapleford, 5 September 2011 \n^ Nick Palmer is Labour’s choice for Broxtowe, Labour East Midlands, 3 August 2013", 
        "ns": 0, 
        "pageid": 433777, 
        "title": "Nick Palmer"
    }
}