{
    "first_para": "Jonathan George Caladine Lord (born 17 September 1962) is a British Conservative Party politician who was elected as the Member of Parliament (MP) for Woking at the 2010 general election. He succeeded Humfrey Malins, his Conservative predecessor who stood down at that election.", 
    "full": {
        "extract": "Jonathan George Caladine Lord (born 17 September 1962) is a British Conservative Party politician who was elected as the Member of Parliament (MP) for Woking at the 2010 general election. He succeeded Humfrey Malins, his Conservative predecessor who stood down at that election.\nWhile serving on Westminster City Council (1994–2002), he stood unsuccessfully for Parliament in Oldham West and Royton in 1997, becoming deputy leader of Westminster Council between 1998 and 2000. For the 2005 general election, he managed the election campaign for Anne Milton MP, subsequently becoming chair of her local (Guildford) Conservative Association and serving on Surrey County Council between 2009 and 2011.\nLord was selected to fight the Woking seat, during the Conservative Party's 2009 experiment with primary elections. He has a marketing background, having been a director of Saatchi & Saatchi for two years. He is one of 13 vice-presidents of The Debating Group.\nBorn in 1962 of His Honour John Herent Lord, a circuit judge, and (June) Ann Lord (née Caladine), his education included a scholarship to Kent School in Connecticut. He graduated in 1985 with a BA in History from Merton College, Oxford, and was president of the Oxford University Conservative Association in Michaelmas Term 1983. He married Caroline Commander in 2000, with whom he has two children: John and Katherine.\n^ a b c d e f g h i j k l m n \"LORD, Jonathan George Caladine\". Who's Who. A & C Black, an imprint of Bloomsbury Publishing. December 2012. Retrieved 3 September 2013. \n^ a b c d e \"Biography\". official website. Jonathan Lord. Retrieved 3 September 2013. \n^ The London Gazette: no. 59418. p. 8747. 13 May 2010.\n^ a b c d \"Jonathan Lord selected for Woking\". ConservativeHome. 1 October 2009. Retrieved 3 September 2013. \n^ \"Vice Presidents\". The Debating Group. Retrieved 3 September 2013. \n^ \"LORD, His Honour John Herent\". Who's Who. A & C Black, an imprint of Bloomsbury Publishing. December 2012. Retrieved 3 September 2013.", 
        "ns": 0, 
        "pageid": 23681392, 
        "title": "Jonathan Lord"
    }
}