{
    "first_para": "Simon James Wright (born 15 September 1979) is a British Liberal Democrat politician, who was elected at the 2010 general election as the Member of Parliament (MP) for Norwich South, defeating frontbench incumbent Charles Clarke (Lab), winning 29.7% of the votes cast.", 
    "full": {
        "extract": "Simon James Wright (born 15 September 1979) is a British Liberal Democrat politician, who was elected at the 2010 general election as the Member of Parliament (MP) for Norwich South, defeating frontbench incumbent Charles Clarke (Lab), winning 29.7% of the votes cast.\nHe was educated at Imperial College London (BSc) and King's College London (PGCE).\nWright has worked as a teacher of mathematics at Alderman Peel High School in Wells-next-the-Sea in North Norfolk and was elected as a councillor for the Lancaster North ward (Fakenham) on North Norfolk District Council in 2003. Wright achieved the second highest percentage of the vote of three seats available in the poll behind Cllr Nich Starling (LD).\nLater that year Wright quit teaching to become campaigns officer for Norman Lamb MP (LD), North Norfolk. Coincidentally the member of staff whom he replaced became his wife in 2006.\nIn 2005 Wright oversaw Norman Lamb's General Election victory in North Norfolk increasing the majority from 483 votes to 10,606.\nWright stepped down as campaigns officer in 2007 to devote himself full-time to being his party's prospective parliamentary candidate for Norwich South.\nWright's first parliamentary appointment saw him appointed to the Environmental Audit Select Committee in July 2010.\nOn 9 December 2010, Wright was one of 21 Liberal Democrat MPs to vote against Government proposals to raise university tuition fees The vote was controversial for other Liberal Democrats as many had signed an NUS pledge promising to vote against tuition fee increases.\n^ \"Simon Wright MP\". BBC Democracy Live. BBC. Retrieved 25 July 2010. \n^ http://www.london-gazette.co.uk/issues/59418/notices/1118281/from=2010-05-06;to=2010-05-19;all=returned+westminster/\n^ \"Election 2010: Norwich South\". BBC News. Retrieved 7 May 2010. \n^ North Norfolk Retrieved 2013-07-16\n^ Simonwright.org.uk\n^ \"Tuition fees: How Liberal Democrat MPs voted\", BBC News, accessed 14/12/2010\n^ \"Lib-Dem and Labour MPs would vote together to oppose tuition fee rise\", NUS Online, accessed 14/12/2010", 
        "ns": 0, 
        "pageid": 27266019, 
        "title": "Simon Wright (politician)"
    }
}