{
    "first_para": "Dr Mark Hayes is a British General Practitioner and Labour politician.", 
    "full": {
        "extract": "Dr Mark Hayes is a British General Practitioner and Labour politician.\nHe has been selected as the Labour Party candidate for Selby and Ainsty in the 2015 General Election. He worked as a GP in Tadcaster, and was a founding member of the Selby Primary Care Group in 1998. He is currently Chief Clinical Officer for the NHS Vale of York Clinical Commissioning Group and has written about the challenges facing the NHS following the implementation of the Health and Social Care Act 2012.\nThe concern that there could be a perceived conflict of interest between his position on the CCG and his political ambition was the reason that he did not cast a vote in favour of providing IVF treatment at a Governing Body meeting in August 2014. At that time NHS Vale of York CCG was one of the last CCGs in England that did not commission IVF. However they reversed the decision of the previous North Yorkshire and York Primary Care Trust at the December 2014 Governing Body meeting when they announced the commissioning of IVF.\nDr Hayes has been subject to attacks from the Conservative Party in the local media with 3 local MPs joining his opponent Nigel Adams in these attacks. It was also reported that when questions were raised about a conflict of interest between the roles, he admitted using NHS resources for his campaign, saying ‘the CCG will protect me from unwanted media enquiries.’ Dr Hayes says that he has not used NHS resources for his campaign nor has his role as a candidate adversely affected the running if the CCG. He has been supported by his Governing Body in exercising his right to stand as a candidate in the community he has lived in for 29 years.\nDr Hayes claims credit for achievements as a leader of the local health system in the Vale of York citing the following significant events:\nThe opening of a new \"Section 136 Suite\", otherwise known as a mental health place of safety, at Bootham Park Hospital.\nThe creation of an innovative \"street triage\" service in conjunction with North Yorkshire Police and the mental health trust.\nThe investment in Increasing Access to Psychological Therapies (IAPT) which has quadrupled uptake.\nThe recommissioning of In Vitro Fertilisation (IVF) treatments.\nThe development of plans to build a new mental health facility in York to replace the 240 year old Bootham Park Hospital.\nOn January 27 2015 the CCG was awarded Pioneer Wave 2 status for its innovative work on integrating health and social care.\nAnd finally the transformation of the finances of the health commissioners after converting a debt of £3.5 million inherited from the PCT in April 2013 to a projected surplus of £3.5 million in April 2015.\nHe was accused of hypocrisy after promising to stop health privatisation while helping commission some £11m of services from private providers but in reply said the clinical commissioning group was implementing the policy \"imposed on it by a Tory Prime Minister and Tory Health Secretary\" and that the Labour Party had pledged to repeal the Health and Social Care Act 2012 which was the reason for services having to be put out to tender to private providers.\nHayes has been campaigning in the Selby and Ainsty Constituency and his opponent Nigel Adams has commented that there is \"no such thing as a safe seat\" despite his majority of 12,000 in 2010.", 
        "ns": 0, 
        "pageid": 43823808, 
        "title": "Mark Hayes (doctor)"
    }
}