{
    "first_para": "Richard Townshend Coke (born 1 February 1954), known as Toby Coke and as Richard Toby Coke, is a politician of the UK Independence Party and a landowner and forester in Norfolk, in the east of England. He is currently the UKIP leader in Norfolk County Council. His surname is pronounced \"Cook\".", 
    "full": {
        "extract": "Richard Townshend Coke (born 1 February 1954), known as Toby Coke and as Richard Toby Coke, is a politician of the UK Independence Party and a landowner and forester in Norfolk, in the east of England. He is currently the UKIP leader in Norfolk County Council. His surname is pronounced \"Cook\".\nBorn in 1954 at Weasenham, near Great Massingham in Norfolk, Coke is the elder son of Major Richard Lovel Coke (1918–2001), by his marriage to Molly, a daughter of Walter Townshend Fletcher. His father was a grandson of Thomas Coke, 2nd Earl of Leicester (1822–1909). He was educated at Radley College and Sandhurst and commissioned into the Scots Guards. After four years in the army, he followed a financial services career in the City of London, before going to work in Canada and the United States. He returned to Norfolk to run the family estate, which consists largely of woodland, and now operates a training course at the Weasenham estate called \"Extreeme Adventure.\"\nA climate change sceptic, Coke has said he is\n\n\"fundamentally opposed to the climate change scam which is causing fuel poverty and the monstrous wind turbines that threaten so much of our most picturesque countryside.\"\n\nAt the Norfolk County Council election on 2 May 2013, Coke was elected to represent the Gayton and Nar Valley electoral division and a few days later was chosen as leader of the county council's UKIP group of fifteen councillors, making him leader of the opposition\".\nAt the general election of 2010 Coke unsuccessfully contested Mid Norfolk for UKIP and is now UKIP's prospective parliamentary candidate for North West Norfolk. He commented that before 2010 he had no involvement in politics apart from \"dabbling in parish politics\".\n\n", 
        "ns": 0, 
        "pageid": 40702374, 
        "title": "Richard Toby Coke"
    }
}