{
    "first_para": "Anne Christine Snelgrove (born 7 August 1957) is a British Labour Party politician, who was the Member of Parliament (MP) for Swindon South from 2005 to 2010; from June 2009 to May 2010, she was a Parliamentary Private Secretary to Prime Minister Gordon Brown. In the 2010 general election, she lost her constituency of Swindon South to Conservative MP Robert Buckland. Snelgrove has been selected by the Labour Party to stand in the next general election, expected to be held in 2015.", 
    "full": {
        "extract": "Anne Christine Snelgrove (born 7 August 1957) is a British Labour Party politician, who was the Member of Parliament (MP) for Swindon South from 2005 to 2010; from June 2009 to May 2010, she was a Parliamentary Private Secretary to Prime Minister Gordon Brown. In the 2010 general election, she lost her constituency of Swindon South to Conservative MP Robert Buckland. Snelgrove has been selected by the Labour Party to stand in the next general election, expected to be held in 2015.\nShe was educated at Ranelagh School in Bracknell, the University of Winchester and City University, London, and previously stood unsuccessfully for Parliament in Bracknell in 1997. She is a member of the Co-operative Party, Amicus and Amnesty International. Previously she worked in education, as a teacher for eight years and Local Education Authority Adviser for seven years.\nHer praise of John Prescott before the House of Commons led the satirical magazine Private Eye to award her a special backbench \"OBN\" (Order of the Brown Nose - a satire on the honour OBE).\nShe led the campaign to help victims of the collapse of Farepak, the hamper company that was based in her constituency.\nShe launched the Geared for Giving campaign in May 2008 with Duncan Bannatyne OBE.\nShe became an Arthritis Research UK Arthritis Champion in 2015.\n^ http://annesnelgrove.org.uk/blog/2011/07/labours-prospective-parliamentary-candidate-south-swindon\n^ Hansard: \"...there is a great deal of pride in the party and the country about the role that the Deputy Prime Minister has played. In particular, we are pleased to hear that his responsibilities have now been defined.\n^ Ford, Emily (26 June 2009). \"Could you live on 98 per cent of your pay?\". The Times (News International). Retrieved 2009-10-24. \n^ \"Anne Snelgrove becomes an Arthritis Champion\". Swindon Advertiser (Newsquest). 29 January 2015. Retrieved 2015-02-18.", 
        "ns": 0, 
        "pageid": 1872160, 
        "title": "Anne Snelgrove"
    }
}