{
    "first_para": "George Galloway (born 16 August 1954) is a British politician, broadcaster, and writer. Since late March 2012 he has been the Respect Party Member of Parliament (MP) for Bradford West.", 
    "full": {
        "extract": "George Galloway (born 16 August 1954) is a British politician, broadcaster, and writer. Since late March 2012 he has been the Respect Party Member of Parliament (MP) for Bradford West.\nAfter first becoming known in Scottish politics, he became General Secretary of the London-based charity War on Want in 1983, remaining in the post until 1987. Galloway was elected in that year's general election as a Labour Party MP representing Glasgow Hillhead. From 1997, Galloway represented its successor constituency Glasgow Kelvin, and remained as the MP for the seat until 2005. In October 2003, Galloway was expelled from Labour, having been found guilty of four charges of bringing the party into disrepute.\nHe became a member of the Respect Party in 2004 (eventually its leader), and was elected as the MP for Bethnal Green and Bow at the general election the following year. After unsuccessfully contesting the seat of Poplar and Limehouse in 2010, he returned as a Westminster MP following the Bradford West by-election in March 2012.\nEarly in his career Galloway was an opponent of Saddam Hussein, but he has been accused by David Aaronovitch and Christopher Hitchens of changing his mind about the Iraqi leader when it became Western policy not to support him. Galloway visited Iraq in 1994 and delivered a speech to Saddam Hussein. which ended in English with the statement: \"Sir, I salute your courage, your strength, your indefatigability.\" He has maintained that he was addressing the Iraqi people in the speech. Galloway testified to the United States Senate in 2005 over alleged illicit payments from the United Nations' Oil for Food Program.\nGalloway is a campaigner who supports the Palestinian side of the Israeli–Palestinian conflict, taking an anti-Zionist stance, and was involved in the Viva Palestina aid convoys. Galloway abruptly withdrew from a debate at Oxford University in 2013, after he discovered the other speaker had joint British-Israeli citizenship.\nGalloway was described by Tom Happold of The Guardian in 2005 as being \"renowned for his colourful rhetoric and combative debating style.\" The Spectator awarded him Debater of the Year in 2001.", 
        "ns": 0, 
        "pageid": 18247133, 
        "title": "George Galloway"
    }
}