{
    "first_para": "David Michael Davis (born 23 December 1948) is a British Conservative Party politician who is the current elected Member of Parliament (MP) for the parliamentary constituency of Haltemprice and Howden. Davis was sworn of the Privy Council in the 1997 New Year Honours List, having previously been Minister of State at the Foreign Office from July 1994 to April 1997.", 
    "full": {
        "extract": "David Michael Davis (born 23 December 1948) is a British Conservative Party politician who is the current elected Member of Parliament (MP) for the parliamentary constituency of Haltemprice and Howden. Davis was sworn of the Privy Council in the 1997 New Year Honours List, having previously been Minister of State at the Foreign Office from July 1994 to April 1997.\nDavis was raised on Aboyne Estate, a council estate in Tooting, South West London. After attending Bec Grammar School in Tooting, London, he went on to gain a Master's degree in business at the age of 25, and went into a career with Tate & Lyle.\nEntering Parliament in 1987 at the age of 38 for the Boothferry constituency, in his subsequent political career he held the positions of Conservative party chairman and Shadow Deputy Prime Minister. Between 2003 and 2008, he was the Shadow Home Secretary in the shadow cabinet, under both Michael Howard and David Cameron. Davis had previously been a candidate for the leadership of the Conservative Party in 2001 and 2005, coming fourth and then second.\nOn 12 June 2008, Davis unexpectedly announced his intention to resign as an MP, and was immediately replaced as Shadow Home Secretary. This was in order to force a by-election in his seat, for which he intended to seek re-election by mounting a specific campaign designed to provoke wider public debate about the erosion of civil liberties in the United Kingdom. Following his formal resignation as an MP on 18 June 2008, he officially became the Conservative candidate in the resulting by-election and won it on 10 July 2008. Davis was invited by Prime Miniter David Cameron to join the cabinet of his coalition government, but he declined, staying on the backbenches to scrutinise and critique the government.", 
        "ns": 0, 
        "pageid": 352474, 
        "title": "David Davis (British politician)"
    }
}