{
    "first_para": "George Iain Duncan Smith (born 9 April 1954), often referred to by his initials IDS, is a British Conservative Party politician who is the current Secretary of State for Work and Pensions.", 
    "full": {
        "extract": "George Iain Duncan Smith (born 9 April 1954), often referred to by his initials IDS, is a British Conservative Party politician who is the current Secretary of State for Work and Pensions.\nHe was previously the Leader of the Conservative Party and Leader of the Opposition from 2001 to 2003. He was first elected to Parliament in 1992 as the MP for Chingford, and he has represented its successor constituency of Chingford and Woodford Green since 1997.\nDuncan Smith was born in Edinburgh and served in the Scots Guards from 1975 to 1981, seeing tours in Northern Ireland and Rhodesia. He joined the Conservative Party in 1981, and was elected as a Member of Parliament in 1992. Duncan Smith succeeded William Hague as Conservative Leader in 2001, winning the leadership election partly on the support of Margaret Thatcher for his Eurosceptic ideology. Duncan Smith was the first Catholic to serve as a Conservative Leader, and the first to be born in Scotland since Arthur Balfour. In 2010, \"The Tablet\" named him one of Britain’s most influential Catholics.\nHis time as Conservative Leader saw his party fall in opinion polls, and many Conservative MPs came to consider him incapable of winning an election. In 2003 his MPs passed a vote of no confidence in his leadership; he immediately resigned, and was succeeded by Michael Howard. As a backbencher, he founded the centre-right Centre for Social Justice, a think tank independent of the Conservative Party, and became a published novelist, though his novel The Devil's Tune received heavily critical reviews. On 12 May 2010, Prime Minister David Cameron appointed Duncan Smith to serve in the Cabinet as Secretary of State for Work and Pensions.", 
        "ns": 0, 
        "pageid": 159548, 
        "title": "Iain Duncan Smith"
    }
}