{
    "first_para": "Alexander Boris de Pfeffel Johnson (born 19 June 1964) is a British politician, popular historian, and former journalist who has served as Mayor of London since 2008. He previously served as the Member of Parliament (MP) for Henley from 2001 until 2008. A member of the Conservative Party, Johnson describes himself as a One Nation Conservative and has been associated with both economically liberal and socially liberal policies.", 
    "full": {
        "extract": "Alexander Boris de Pfeffel Johnson (born 19 June 1964) is a British politician, popular historian, and former journalist who has served as Mayor of London since 2008. He previously served as the Member of Parliament (MP) for Henley from 2001 until 2008. A member of the Conservative Party, Johnson describes himself as a One Nation Conservative and has been associated with both economically liberal and socially liberal policies.\nBorn in New York City to upper middle-class English parentage, Johnson was educated at the European School of Brussels, Ashdown House School, and Eton College. He read Classics at Balliol College, Oxford, where he was a member of the Bullingdon Club and was elected President of the Oxford Union in 1986. Beginning his career in journalism at The Times, he soon moved to The Daily Telegraph; as the newspaper's Brussels correspondent his articles were a strong influence on growing Eurosceptic sentiment among the British right-wing. He became assistant editor from 1994 to 1999 before taking editorship of The Spectator from 1999 to 2005. Joining the Conservatives, he was elected MP for Henley in 2001. During his period in the House of Commons, Johnson became one of the most conspicuous politicians in the country, authoring books and making regular television appearances. Under Conservative leaders Michael Howard and David Cameron, Johnson served on the opposition front bench, first as Shadow Minister for Culture, Communications and Creative Industries and then for Higher Education.\nSelected as Conservative candidate for the 2008 London mayoral election, Johnson defeated Labour incumbent Ken Livingstone to become Mayor, resigning his seat in parliament. During his first term, he banned alcohol consumption on public transport, introduced the New Routemaster buses and 'Boris Bikes', and championed London's financial sector. In 2012, he was re-elected as Mayor, again defeating Livingstone; during his second term he oversaw the 2012 London Olympic Games. He is currently standing as prospective MP for Uxbridge and South Ruislip in the 2015 general election.\nJohnson is a controversial figure in British politics and journalism. Supporters have praised him as an entertaining, humorous, and popular figure with appeal beyond traditional Conservative voters. Critics have accused him of being out of touch with working people, laziness and dishonesty, and racism and homophobia. He is the subject of several biographies and a number of fictionalised portrayals.", 
        "ns": 0, 
        "pageid": 19065069, 
        "title": "Boris Johnson"
    }
}