{
    "first_para": "Julia Gasper is an English specialist in eighteenth-century French literature and a right-wing political activist affiliated with the English Democrats. She used to be a member of the United Kingdom Independence Party (UKIP). A vociferous critic of LGBT rights, she has generated strong controversy in the British media for her comments regarding LGBT people, which have widely been deemed homophobic and transphobic.", 
    "full": {
        "extract": "Julia Gasper is an English specialist in eighteenth-century French literature and a right-wing political activist affiliated with the English Democrats. She used to be a member of the United Kingdom Independence Party (UKIP). A vociferous critic of LGBT rights, she has generated strong controversy in the British media for her comments regarding LGBT people, which have widely been deemed homophobic and transphobic.\nIn 1987 Gasper obtained a D.Phil in English Literature from the University of Oxford after studying at Somerville College. Her thesis examined the Protestant plays of Elizabethan English playwright Thomas Dekker. She has since published a number of books on eighteenth-century French literature, including Theodore von Neuhoff, King of Corsica (2012), and The Marquis d'Argens (2013).\nIn 2012 Gasper was selected as UKIP's Parliamentary candidate for Oxford East. She was scrutinised for her anti-LGBT blog posts by LGBT-themed news service Pink News, whose readers she then asserted were mentally ill. When The Sunday Mirror exposed further anti-LGBT comments that she had made on a UKIP members forum, she was denounced by party leader Nigel Farage and stepped down from her position. Changing her allegiance to the English Democrats, she unsuccessfuly stood for them in the European Parliament elections, 2014 and for Oxford City Council in a local by-election. She meanwhile continued to attract strong criticism for her public condemnation of LGBT rights issues.", 
        "ns": 0, 
        "pageid": 43893257, 
        "title": "Julia Gasper"
    }
}