{
    "first_para": "Gerard \"Gerry\" Adams (Irish: Gearóid Mac Ádhaimh; born 6 October 1948) is an Irish republican politician, president of the Sinn Féin political party, and a Teachta Dála (member of Parliament) for Louth since the 2011 general election.", 
    "full": {
        "extract": "Gerard \"Gerry\" Adams (Irish: Gearóid Mac Ádhaimh; born 6 October 1948) is an Irish republican politician, president of the Sinn Féin political party, and a Teachta Dála (member of Parliament) for Louth since the 2011 general election.\nFrom 1983 to 1992 and from 1997 to 2011, he was an abstentionist Westminster Member of Parliament (MP) for Belfast West.\nHe has been the president of Sinn Féin since 1983. Since that time the party has become the fourth-largest party in the Republic of Ireland, the second-largest political party in Northern Ireland and the largest Irish nationalist party in that region. In 1984, Adams was seriously wounded in an assassination attempt by several gunmen from the Ulster Defence Association (UDA) including John Gregg. From the late 1980s onwards, Adams was an important figure in the Northern Ireland peace process, initially following contact by the then-Social Democratic and Labour Party (SDLP) leader John Hume and then subsequently with the Irish and British governments.\nIn 2005, the Provisional Irish Republican Army (IRA) indicated that its armed campaign was over and that it was exclusively committed to democratic politics. Under Adams, Sinn Féin changed its traditional policy of abstentionism towards the Oireachtas, the Parliament of the Republic of Ireland, in 1986 and later took seats in the power-sharing Northern Ireland Assembly.\nIn 2014, he was arrested for questioning and held for four days by the Police Service of Northern Ireland in connection with the abduction and murder of Jean McConville in 1972. He was freed without charge and a file was to be compiled and sent to the Public Prosecution Service for Northern Ireland.", 
        "ns": 0, 
        "pageid": 38117, 
        "title": "Gerry Adams"
    }
}