{
    "first_para": "Uma Kumaran is a British Labour politician. Uma was selected as Labour candidate for the Harrow East constituency in November 2013. She was one of 15 Labour candidates each given financial support of £10,000 by Lord Matthew Oakeshott the former Liberal Democrat peer.", 
    "full": {
        "extract": "Uma Kumaran is a British Labour politician. Uma was selected as Labour candidate for the Harrow East constituency in November 2013. She was one of 15 Labour candidates each given financial support of £10,000 by Lord Matthew Oakeshott the former Liberal Democrat peer.\nShe was educated at Newton Farm Primary School, Bentleywood High School and St Dominic's Sixth Form College, all in Harrow. She completed her BA Politics and MSc Public Policy at Queen Mary University, during which time she wrote for the International Tamil Newspaper Orupaper. She then worked for the NHS before taking an internship as a caseworker for a Labour MP. She is a volunteer presenter and producer at Northwick Park Hospital radio.\nKumaran's selfie was seen by millions of Americans when her picture was used on the show hosted by Ellen DeGeneres. Labour MPs Sadiq Khan, Diane Abbott, Steve Pound, Andy Slaughter, Heidi Alexander, and Gareth Thomas were also in the photo.\nHer parents moved to Harrow to escape the civil war in Sri Lanka where her grandfather was a civil servant and trade unionist.\nIt was alleged in January 2014 by Harrow’s now defunct Independent Labour Group that she did nothing to support the Tamil community when demonstrations were taking place outside Parliament to raise awareness of human rights violations by the Sri Lankan Government nor to support their complaints about discrimination against Tamils in the Labour Party. KUmaran later wrote to the editor of iharrow asking that the article be removed because it contained slanderous accusations and false allegations and had been used as a way of setting up a wikipedia page to continue false rumours and divisive politics along ethnic lines. She said the article was \"simply the personal vendetta of a member of the ‘ILG’ and is deeply damaging and completely untrue.\" The post was removed. \nIn September 2014 it was reported that she called upon minorities and voters from migrant backgrounds to vote ‘no’ in the Scottish referendum.\nA picture of her celebrating the traditional Tamil harvest festival of Thai Pongal on January 14, 2015 at the Harrow Council chambers was featured in the Tamil Guardian.\nShe was one of 106 candidates in ‘battleground seats’ who accepted a £1,000 donation from former Prime Minister Tony Blair and one of 30 who were given £20,000 by Lord Oakeshott. . Conservative Home reported that her campaign placed a particular emphasis on saving Harrow’s comprehensives from “the Tory-led government’s dismantling of education as we know it”", 
        "ns": 0, 
        "pageid": 43824087, 
        "title": "Uma Kumaran"
    }
}