{
    "first_para": "Jean Urquhart (born 17 May 1949) is an independent member of the Scottish Parliament, elected in 2011 for the Highlands and Islands.", 
    "full": {
        "extract": "Jean Urquhart (born 17 May 1949) is an independent member of the Scottish Parliament, elected in 2011 for the Highlands and Islands.\nIn 2003 she became a Scottish National Party councillor at the Highland Council, having been elected for the Lochbroom Ward. In 2007 she was returned as councillor for Wester Ross, Strathpeffer and Lochalsh. She was then named as vice-convener to lead an Independent/ SNP administration. In 2009 the Steering Group of the UK's first ever Housing Fair appointed her as its chair when this event was held near Inveness.\nIn the 2011 Scottish Parliament Election she was elected from the regional list, becoming a SNP Member of the Scottish Parliament for the Highlands and Islands. She was a member of the Scottish National Party until October 2012, when she resigned from the party over the change to the party's NATO policy.\nShe is owner of \"The Ceilidh Place\", a hotel in Ullapool which was named Venue of the Year at the Scots Trad awards in December 2014 for its championing of Scottish culture all year round. She was married to Robert Urquhart, a well-known Scottish actor in British film, stage and television, who died in 1995.\nShe had been awarded a MBE in 1990 for services to the arts and the community, however in 2015 it was reported that she had decided to hand back the honour, explaining that the awards system did not recognise the efforts of the many other people that had been involved.\nIn 2000 she took a Scottish Studies course at Newbattle Abbey College. She received an honorary fellowship from the University of the Highlands and Islands in 2006.\n^ \"Jean Urquhart: Personal Information\". Scottish Parliament. Retrieved 10 January 2015. \n^ \"Jean Urquhart MSP\". The Scottish Parliament. Retrieved 18 June 2013. \n^ \"Local government elections: Election results 2003\". Highland Council. Retrieved 10 January 2015. \n^ \"Local government elections: Election results 2007\". Highland Council. Retrieved 10 January 2015. \n^ \"Leaders elected to north councils\". BBC News (BBC). 17 May 2007. \n^ \"Urquhart set to spearhead housing fair\". Ross-shire Journal. 28 December 2007. Retrieved 19 January 2015. \n^ \"The Highland Housing Fair\". Architects' Journal. 11 January 2008. Retrieved 19 January 2015. \n^ \"Scotland elections: Regions: Highlands and Islands\". BBC News (BBC). 11 May 2011. \n^ Ross, David (23 October 2012). \"Highland MSPs quit SNP over Nato policy change\". Herald Scotland (Newsquest). Retrieved 18 June 2013. \n^ Ferguson, Brian (13 December 2014). \"Trad Music Awards: Martyn Bennett Story victorious\". The Scotsman. Retrieved 10 January 2015. \n^ Bevington, Pete (8 January 2015). \"Local MSP hands back her MBE\". The Shetland News. Retrieved 10 January 2015. \n^ \"Alumni: Jean Urquhart\". Newbattle Abbey College. Retrieved 10 January 2015. \n^ \"honorary awards: honorary fellowships: 2006 honorary fellowships\". University of the Highlands and Islands. Retrieved 20 January 2015.", 
        "ns": 0, 
        "pageid": 31756395, 
        "title": "Jean Urquhart"
    }
}