{
    "first_para": "Stewart Dickson is an Alliance Party of Northern Ireland politician and member of the Northern Ireland Assembly, where he represents East Antrim.", 
    "full": {
        "extract": "Stewart Dickson is an Alliance Party of Northern Ireland politician and member of the Northern Ireland Assembly, where he represents East Antrim.\nDickson entered politics in 1977, when he was elected to Carrickfergus Borough Council representing Area A, the predecessor of the Knockagh Monument electoral area. He lost his seat to the Democratic Unionist Party in the 1981 local elections but regained it at the 1985 local elections and has been re-elected at each local election since then. He served as Mayor from 1992 to 1993\nDickson unsuccessfully contested the East Antrim constituency at the 1996 Northern Ireland Forum election and the Assembly elections of 1998, 2003 and 2007, before winning the seat held by former Alliance leader Sean Neeson at the 2011 elections.\nHe is Chief Whip of the Alliance Party Assembly Group and a member of the party's Executive Committee. Dickson is a member of the Northern Ireland Assembly Committees for Social Development, Justice, and the Assembly Business committee, where he contributes to the formulation of the Assembly's weekly agenda. In addition to his Committee responsibilities, Dickson is a member of the Assembly All Party Groups on Diabetes (Vice Chair) and International Development.\nOutside political life, he is a retired member of the Northern Ireland Public Service Alliance trade union and the Greenisland Presbyterian Church where he and his wife Sandra are both Elders. He has served as Captain of First Greenisland Boys’ Brigade, through which he has run drug awareness courses, he is a former long serving member and chair of the Boards of Governors of Carrickfergus Central and Silverstream Primary Schools. Prior to his election to the NI Assembly he worked as Arbitration Secretary at the Northern Ireland Labour Relations Agency.\n^ Carrickfergus election results 1973-1981 Ark.ac.uk, accessed 8 May 2011\n^ Carrickfergus election results 1985-1989 Ark.ac.uk, accessed 8 May 2011\n^ a b Newtownabbey Times, 23 February 2007\n^ Northern Ireland Assembly elections: East Antrim results, Belfast Telegraph, 7 May 2011\n^ 'About Stewart', from his Official Website, Accessed 9 November 2012", 
        "ns": 0, 
        "pageid": 31716644, 
        "title": "Stewart Dickson"
    }
}