{
    "first_para": "Nigel Paul Farage (/ˈfærɑːʒ/; born 3 April 1964) is a British politician and leader of the UK Independence Party (UKIP) since 2010, a position he also held from September 2006 to November 2009. Since 1999 he has been a Member of the European Parliament for South East England. He co-chairs the Europe of Freedom and Direct Democracy (formerly \"Europe of Freedom and Democracy\") group.", 
    "full": {
        "extract": "Nigel Paul Farage (/ˈfærɑːʒ/; born 3 April 1964) is a British politician and leader of the UK Independence Party (UKIP) since 2010, a position he also held from September 2006 to November 2009. Since 1999 he has been a Member of the European Parliament for South East England. He co-chairs the Europe of Freedom and Direct Democracy (formerly \"Europe of Freedom and Democracy\") group.\nFarage was a founding member of UKIP, having left the Conservative Party in 1992 after the signing of the Maastricht Treaty. Having unsuccessfully campaigned in European and Westminster parliamentary elections for UKIP since 1994, he was elected as MEP for South East England in the 1999 European Parliament Election. In the 2014 European Election, Farage was re-elected again and led UKIP to its first victory in a nationwide UK election—the first for a party other than the Conservatives or Labour since the 1906 general election.\nIn September 2006, Farage became the UKIP Leader and led the party through the 2009 European Parliament Election when it won the second-highest share of the popular vote, defeating Labour and the Liberal Democrats with over two million votes. He stepped down in November 2009 to concentrate on contesting Buckingham, the constituency of the Speaker, John Bercow, at the 2010 general election, coming third. In November 2010, Farage successfully stood in the 2010 UKIP leadership contest, following the resignation of Lord Pearson of Rannoch. In August 2014, Farage was selected to contest the South Thanet seat in Kent at the 2015 general election.\nFarage was ranked 41st in The Daily Telegraph's Top 100 most influential right-wingers poll in October 2009, citing his media awareness and his success with UKIP in the European Elections. Farage was ranked 58th in the 2010 list compiled by Iain Dale and Brian Brivati for The Daily Telegraph. In the 2012 list, Farage was ranked 17th, and in 2013 he was ranked second behind Prime Minister David Cameron. In 2014, he was ranked first, ahead of Cameron. He was also named \"Briton of the Year\" by The Times in 2014.\nFarage has been noted for his passionate and sometimes controversial speeches in the European Parliament and has strongly criticised the euro, the EU's single currency.", 
        "ns": 0, 
        "pageid": 415700, 
        "title": "Nigel Farage"
    }
}