{
    "first_para": "Edward Hugh Christian McMillan-Scott (born 15 August 1949) is a British politician. He is Liberal Democrat candidate in 7 May 2015 general election for the Yorkshire parliamentary seat of Normanton, Pontefract and Castleford.", 
    "full": {
        "extract": "Edward Hugh Christian McMillan-Scott (born 15 August 1949) is a British politician. He is Liberal Democrat candidate in 7 May 2015 general election for the Yorkshire parliamentary seat of Normanton, Pontefract and Castleford.\nHe was a Member of the European Parliament (MEP) for Yorkshire and the Humber constituency. He was elected four times as European Parliament Vice-President, 2004–2014. His main portfolio was Human Rights and Democracy. He was first elected as an MEP in 1984. McMillan-Scott was a Conservative until a dispute over the move of the Conservatives to a newly created, then moderately eurosceptic parliamentary group, the European Conservatives and Reformists; he was expelled from the Conservatives, and eventually joined the Liberal Democrats in March 2010. On 22 November 2014 he was voted a Patron of the European Movement at its London AGM.\nMcMillan-Scott was leader of the Conservative MEPs 1997–2001. He was re-elected top of the Yorkshire & Humber regional list in the 2009 election. McMillan-Scott is a lifelong pro-European. Following David Cameron's decision to withdraw the Conservative MEPs from the centrist European People's Party in order to form the European Conservative and Reformist's Group, McMillan-Scott objected. When the composition of Cameron's new ECR group was announced after the European elections of 2009, McMillan-Scott protested. The new group was described by Liberal Democrat leader Nick Clegg as \"a bunch of nutters, homophobes, anti-Semites and climate-change deniers\". He successfully stood as an independent Vice-President against the nominee of the ECR Group, Polish MEP Michal Kaminski, criticising Kaminski's alleged past links to extremism, confirmed inter alia by the Daily Telegraph. He is the only Vice-President to have been elected without an official party candidature. As a result of this protest, he had the whip withdrawn and was subsequently expelled from the Conservative Party.\nIn March 2010, he joined the Liberal Democrats with whom he had usually worked closely on democracy and human rights issues. In May 2010 he became a member of the Group of the Alliance of Liberals and Democrats for Europe in the European Parliament. He then sat as ALDE Vice-President of the European Parliament. In January 2012, he was re-elected as Vice-President for the fourth time. He once again received the portfolio for Democracy and Human Rights as well as additionally gaining the Sakharov Prize Network, which underpins the parliament's annual prize for freedom of expression and responsibility for transatlantic relations. In the 2014 election he lost his seat as an MEP in an election that saw nation-wide gains for the UK Independence Party, and the Liberal Democrats lose all but one of their seats.", 
        "ns": 0, 
        "pageid": 23799445, 
        "title": "Edward McMillan-Scott"
    }
}