{
    "first_para": "Sir Edward Julian Egerton Leigh MP (born 20 July 1950) is a British Conservative politician and parliamentarian.", 
    "full": {
        "extract": "Sir Edward Julian Egerton Leigh MP (born 20 July 1950) is a British Conservative politician and parliamentarian.\nLeigh has represented Gainsborough, Lincolnshire in the House of Commons as its Member of Parliament since 1997, and for its predecessor constituency of Gainsborough and Horncastle between 1983 and 1997. He served as Chairman of the Public Accounts Committee for 10 years between 2001 and 2010, investigating government waste and seeking value for money in government expenditure. Under his leadership, the Public Accounts Committee was responsible for saving the taxpayer over £4 billion. Sir Edward stepped down at the end of the parliamentary session in 2010 as it is customary for a member of the opposition party to hold this post.\nLeigh was knighted in the 2013 Birthday Honours for \"public and political service\", and was dubbed \"the Viscount\" in the House of Commons, in allusion to his landed gentry background.\nLeigh has earned a reputation for opposing abortion and genetic research on religious grounds. He also defended Section 28, which barred Local Authorities from promoting \"the teaching in any maintained-school of the acceptability of homosexuality as a pretended family relationship.\" Leigh himself was a vocal opponent of the Civil Partnership Act 2004 and voted against it in Parliament at its Second Reading. Once passed, Leigh proposed an amendment to the Act to extend the property and pension rights afforded by civil partnerships to siblings who had lived together for more than 12 years. This was opposed by many backers of the initial Bill, such as fellow Conservative MP Sir Alan Duncan, who considered it a wrecking amendment.\nA veteran backbencher, Leigh was encouraged to challenge for the Speakership of the House of Commons, and after the 2010 general election for one of the Deputy Speakerships, but chose not to pursue this ambition for the time being since parliamentary convention precludes members of the governing party being elected to such high office, unless already in situ. Described as an \"intelligent but prankish and unpredictable radical rightwing intellectual\"  and a Tory rebel, Leigh does not hesitate to go against the leadership of his party for his own principles. He speaks regularly in the House of Commons, mainly on civil liberties, constitutional, ecclesiastical and economic matters.", 
        "ns": 0, 
        "pageid": 428603, 
        "title": "Edward Leigh"
    }
}