{
    "first_para": "Nicole \"Nikki\" Sinclaire (born 26 July 1968) is a former politician from the United Kingdom and was the We Demand a Referendum Party Member of the European Parliament for the West Midlands. In the 2014 European elections, she conceded she had lost her seat. In a statement on her website she said: \"my employers have spoken, and it would seem I have been unsuccessful in my attempt to be re-elected as an MEP for the West Midlands region.\" She was elected MEP in June 2009 as a UK Independence Party candidate but later resigned from the Europe of Freedom and Democracy (EFD) group in which UKIP is part of in the European Parliament, citing the alleged extreme right-wing views of some of the group's members. Subsequently Sinclaire sat as an Independent MEP from January 2010 until in September 2012 she set up the We Demand a Referendum party.", 
    "full": {
        "extract": "Nicole \"Nikki\" Sinclaire (born 26 July 1968) is a former politician from the United Kingdom and was the We Demand a Referendum Party Member of the European Parliament for the West Midlands. In the 2014 European elections, she conceded she had lost her seat. In a statement on her website she said: \"my employers have spoken, and it would seem I have been unsuccessful in my attempt to be re-elected as an MEP for the West Midlands region.\" She was elected MEP in June 2009 as a UK Independence Party candidate but later resigned from the Europe of Freedom and Democracy (EFD) group in which UKIP is part of in the European Parliament, citing the alleged extreme right-wing views of some of the group's members. Subsequently Sinclaire sat as an Independent MEP from January 2010 until in September 2012 she set up the We Demand a Referendum party.\nAlthough mainly known for her Eurosceptic views, Sinclaire has campaigned on other issues affecting West Midlands people, from jobs and the environment to human rights. She was the first ever transgender British parliamentarian.", 
        "ns": 0, 
        "pageid": 14496904, 
        "title": "Nikki Sinclaire"
    }
}