{
    "first_para": "Richard Baker (born 29 May 1974) is a Scottish Labour politician, and member of the Scottish Parliament (MSP) for the North East Scotland region. He was first elected in the 2003 general election, when he was the youngest sitting MSP. He is a former member of Labour's Shadow Cabinet in the Scottish Parliament having served as the Shadow Cabinet Secretary for Justice and Shadow Cabinet Secretary for Finance. In the early part of 2014, he was selected to fight Aberdeen North in 2015, after current MP Frank Doran announced his retirement.", 
    "full": {
        "extract": "Richard Baker (born 29 May 1974) is a Scottish Labour politician, and member of the Scottish Parliament (MSP) for the North East Scotland region. He was first elected in the 2003 general election, when he was the youngest sitting MSP. He is a former member of Labour's Shadow Cabinet in the Scottish Parliament having served as the Shadow Cabinet Secretary for Justice and Shadow Cabinet Secretary for Finance. In the early part of 2014, he was selected to fight Aberdeen North in 2015, after current MP Frank Doran announced his retirement.\nBaker was born in Edinburgh to an Episcopalian priest father and English teacher mother, and is godson to the then Episcopalian Bishop of Aberdeen. He was educated at the independent St. Bees School in Cumbria and at Aberdeen University.\nHe was the elected President of the National Union of Students Scotland from 1998 till 2000 and before that the Senior Vice-President (an elected, full-time sabbatical officer post) at the University of Aberdeen Students' Representative Council (now Aberdeen University Students' Association) in the academic year 1995/96. He is a former Scottish Press Officer of Help the Aged.\nBaker was selected in March 2014 to be Labour's Candidate for Aberdeen North in the 2015 General Election. The seat is currently held by Frank Doran. He is a member of Unite the Union and the Co-operative Party.\nHis wife, Claire Brennan-Baker became an MSP after the 2007 election, but for the Mid Scotland and Fife region.\n^ Times Higher article 24 December 1999 http://www.timeshighereducation.co.uk/story.asp?storyCode=149450&sectioncode=26", 
        "ns": 0, 
        "pageid": 553134, 
        "title": "Richard Baker (Scottish politician)"
    }
}