{
    "first_para": "James Gordon Brown (born 20 February 1951) is a British Labour Party politician who was the Prime Minister of the United Kingdom and Leader of the Labour Party from 2007 until 2010. He previously served as Chancellor of the Exchequer in the Labour Government from 1997 to 2007. Brown was a Member of Parliament (MP) from 1983 to 2015, first for Dunfermline East and currently for Kirkcaldy and Cowdenbeath.", 
    "full": {
        "extract": "James Gordon Brown (born 20 February 1951) is a British Labour Party politician who was the Prime Minister of the United Kingdom and Leader of the Labour Party from 2007 until 2010. He previously served as Chancellor of the Exchequer in the Labour Government from 1997 to 2007. Brown was a Member of Parliament (MP) from 1983 to 2015, first for Dunfermline East and currently for Kirkcaldy and Cowdenbeath.\nA doctoral graduate of the University of Edinburgh, Brown spent his early career working as both a lecturer at a further education college and a television journalist. He entered Parliament in 1983 as the MP for Dunfermline East. He joined the Shadow Cabinet in 1989 as Shadow Secretary of State for Trade, and was later promoted to become Shadow Chancellor of the Exchequer in 1992. After Labour's victory in 1997, he was appointed Chancellor of the Exchequer, becoming the longest-serving holder of that office in modern history.\nBrown's time as Chancellor was marked by major reform of Britain's monetary and fiscal policy architecture, transferring interest rate setting powers to the Bank of England, by a wide extension of the powers of the Treasury to cover much domestic policy and by transferring responsibility for banking supervision to the Financial Services Authority. Controversial moves included the abolition of advance corporation tax (ACT) relief in his first budget, and the removal in his final budget of the 10% \"starting rate\" of personal income tax which he had introduced in 1999. In 2007, Tony Blair resigned as Prime Minister and Labour Leader and Brown was chosen to replace him in an uncontested election.\nAfter initial rises in opinion polls following Brown becoming Prime Minister, Labour's popularity declined with the onset of a recession in 2008, leading to poor results in the local and European elections in 2009. A year later, Labour lost 91 seats in the House of Commons at the 2010 general election, the party's biggest loss of seats in a single general election since 1931, making the Conservatives the largest party in a hung parliament. Brown remained in office as Labour negotiated to form a coalition government with the Liberal Democrats. On 10 May, 2010, Brown announced he would stand down as leader of the Labour Party, and instructed the party to put into motion the processes to elect a new leader. Labour's attempts to retain power failed as on 11 May, he officially resigned as Prime Minister and Leader of the Labour Party. He was succeeded as Prime Minister by David Cameron, and as Leader of the Labour Party by Ed Miliband.\nLater, Brown played a crucial role in the campaign surrounding the Scottish independence referendum of 2014, galvanizing support behind maintaining the union.", 
        "ns": 0, 
        "pageid": 13076, 
        "title": "Gordon Brown"
    }
}