{
    "first_para": "David William Donald Cameron (/ˈkæmᵊrən/; born 9 October 1966) is a British politician who has served as the Prime Minister of the United Kingdom since 2010 and as the Member of Parliament (MP) for Witney since 2001. He has been Leader of the Conservative Party since 2005.", 
    "full": {
        "extract": "David William Donald Cameron (/ˈkæmᵊrən/; born 9 October 1966) is a British politician who has served as the Prime Minister of the United Kingdom since 2010 and as the Member of Parliament (MP) for Witney since 2001. He has been Leader of the Conservative Party since 2005.\nCameron studied Philosophy, Politics and Economics (PPE) at Brasenose College, Oxford, there being a member of the Bullingdon Club. He then joined the Conservative Research Department and became Special Adviser to Norman Lamont, and then to Michael Howard. He was Director of Corporate Affairs at Carlton Communications for seven years. Cameron first stood for Parliament in Stafford in 1997. He ran on a Eurosceptic platform, breaking with his party's then-policy by opposing British membership of the single European currency, and was defeated by a swing close to the national average. He was first elected to Parliament in the 2001 general election for the Oxfordshire constituency of Witney. He was promoted to the Opposition front bench two years later, and rose rapidly to become head of policy co-ordination during the 2005 general election campaign. With a public image of a youthful, moderate candidate who would appeal to young voters, he won the Conservative leadership election in 2005.\nFollowing the election of a hung parliament in the 2010 general election, Cameron became Prime Minister as the leader of a coalition between the Conservatives and Liberal Democrats. Cameron's premiership has been marked by the ongoing effects of the late-2000s financial crisis leading to a large deficit in government finances, which his government has emphasised the need to reduce through austerity measures. His administration has introduced large-scale changes to welfare, immigration policy, education and healthcare, by introducing the Welfare Reform Act of 2012, the Education Act of 2011, the Health and Social Care Act of 2012 and a range of immigration reforms from 2010 onwards, culminating in the Immigration Act of 2014. In 2011, Cameron became the first British Prime Minister to 'veto' an EU treaty. His government introduced a nationwide referendum on voting reform in 2011, a Falkland Islands sovereignty referendum in 2013, agreed to a Scottish independence referendum in September 2014, legalised same-sex marriages in England and Wales, met the United Nations target of spending at least 0.7% of GNI on aid to developing countries and promised an 'In/Out' referendum on the UK's membership of the European Union in 2017, after a period of renegotiation, if the Conservatives are re-elected with an outright majority.\n^ \"David Cameron\". Witney Conservatives. 6 May 2010. Retrieved 22 December 2011. \n^ \"Hall of Fame, David Cameron\". BBC Wales. Retrieved 7 August 2009. \n^ \n^ Morris, Nigel (22 May 2014). \"David Cameron sticks to his guns on immigration reduction pledge even while numbers rise\". The Independent (London). Retrieved 5 July 2014. \n^ \"PM's EU Treaty Veto: 'I Did It For Britain'\". Sky News. 9 December 2011. Retrieved 5 August 2014.", 
        "ns": 0, 
        "pageid": 419342, 
        "title": "David Cameron"
    }
}