{
    "first_para": "William Jefferson Hague FRSL (born 26 March 1961) is a British Conservative politician who has been the First Secretary of State and Leader of the House of Commons since 2014. He previously served as Secretary of State for Foreign and Commonwealth Affairs from 2010 until 2014, Leader of the Conservative Party and Leader of the Opposition from 1997 to 2001, and was the Member of Parliament (MP) for Richmond (Yorks) between 1989 and 2015.", 
    "full": {
        "extract": "William Jefferson Hague FRSL (born 26 March 1961) is a British Conservative politician who has been the First Secretary of State and Leader of the House of Commons since 2014. He previously served as Secretary of State for Foreign and Commonwealth Affairs from 2010 until 2014, Leader of the Conservative Party and Leader of the Opposition from 1997 to 2001, and was the Member of Parliament (MP) for Richmond (Yorks) between 1989 and 2015.\nHague was educated at Wath-upon-Dearne Grammar School, the University of Oxford and INSEAD, eventually being elected to the House of Commons in a by-election in 1989. Hague quickly rose through the ranks of the Major Government and was appointed to the Cabinet in 1995 as Secretary of State for Wales. Following a landslide defeat in the 1997 general election to the Labour Party, he was elected leader of the Conservative Party at the age of 36.\nHe resigned as Conservative Leader after the 2001 general election following a second landslide defeat, at which the Conservatives could only make a net gain of one seat, thus becoming the first Conservative Leader since the role came into being in the early 1920s not to become Prime Minister. He returned to the backbenches, beginning a career as an author, writing biographies of William Pitt the Younger and William Wilberforce. He also held several directorships, and worked as a consultant and public speaker.\nAfter David Cameron was elected Leader of the Conservative Party in 2005, Hague rejoined the Shadow Cabinet as Shadow Foreign Secretary. He also took on the role of \"Senior Member of the Shadow Cabinet\", effectively serving as Cameron's deputy. After the formation of the Coalition Government in 2010, Hague was appointed First Secretary of State and Foreign Secretary. Cameron described him as his \"de facto political deputy\".\nOn 14 July 2014, Hague stood down as Foreign Secretary to become Leader of the House of Commons in preparation for his planned retirement from parliament, after 26 years as an MP, at the United Kingdom general election in 2015.", 
        "ns": 0, 
        "pageid": 161041, 
        "title": "William Hague"
    }
}