{
    "first_para": "Conor Terence Murphy (born 10 July 1963) is an Irish republican Sinn Féin politician. He served as the Member of Parliament for Newry and Armagh.", 
    "full": {
        "extract": "Conor Terence Murphy (born 10 July 1963) is an Irish republican Sinn Féin politician. He served as the Member of Parliament for Newry and Armagh.\nMurphy was born in Newry, County Down. According to An Phoblacht, he first became involved with the Provisional Irish Republican Army (IRA) during the 1981 hunger strikes. In 1982 he was sentenced to five years in prison for IRA membership and possession of explosives.\nBetween 1989 and 1997, he was a Sinn Féin councillor on Newry and Mourne District Council for The Fews area, in South Armagh and South Down, and served as his party's group leader at that level.\nIn 1998, Murphy was elected as one of his party's two Northern Ireland Assembly members for Newry and Armagh. He was re-elected, with two party colleagues, to the Assembly in 2003.\nHe lives in Camlough, County Armagh with his wife Catherine, his daughter Áine and his son Oisín. He attended St. Colman's College, Newry, Queen's University of Belfast (QUB), and the University of Ulster.\nIn 2001, he contested the Newry and Armagh Westminster seat, coming second to incumbent Seamus Mallon of the Social Democratic and Labour Party (SDLP). When Mallon decided not to contest the seat again, Murphy became the clear favourite to win and was elected MP on 5 May 2005.\nHe refuses to take his seat in the House of Commons of the United Kingdom in line with the abstentionist policy of Sinn Féin. In the Northern Ireland Assembly, he served as the Minister for Regional Development in the Northern Ireland Executive from 8 May 2007 until 16 May 2011.\nWhile on a tour of UK party conferences in autumn 2005, he became the first Irish republican to address the Conservative Party conference and caused controversy by refusing to express regret over the Brighton hotel bombing.\nIn 2011, while Minister for Regional Development, Murphy appointed Sean Hogan, a Catholic, as head of Northern Ireland Water, turning down the applications of four Protestants on the shortlist. A tribunal subsequently awarded £150,000 damages for discrimination to one of these applicants, Alan Lennon, judging that Hogan was appointed because \"he was not from a Protestant background and because he was known to the minister and his ministerial colleagues\", Sinn Féin's Catriona Ruane and Michelle Gildernew. The tribunal also found that Murphy's evidence was \"implausible and lack[ing] credibility\", and that, during Murphy's tenure at the Department for Regional Development, there was a \"material bias against the appointment of candidates from a Protestant background\". Murphy disputed the finding which he said branded him \"sectarian\". Deputy First Minister Martin McGuinness defended Conor Murphy saying he does not have \"a sectarian bone in his body\".\nIn December 2012, Murphy appeared as a witness at Belfast High Court in the case of Declan Gormley, who Murphy sacked in 2010 from his post as a non-executive director of NI Water. Gormley sued Sinn Féin over two press releases which he argued were defamatory. Gormley was subsequently offered £80,000 in damages.", 
        "ns": 0, 
        "pageid": 1855077, 
        "title": "Conor Murphy"
    }
}