{
    "first_para": "Dr Helen Geake is an archaeologist who was one of the key members of Channel 4's popular and long-running archaeology series Time Team, presented by Tony Robinson, along with Mick Aston and Phil Harding.", 
    "full": {
        "extract": "Dr Helen Geake is an archaeologist who was one of the key members of Channel 4's popular and long-running archaeology series Time Team, presented by Tony Robinson, along with Mick Aston and Phil Harding.\nGeake was born in Wolverhampton in 1967 but grew up in Bath. She originally trained as a secretary. However, reading archaeology books and attending lectures by Mick Aston led her to study medieval archaeology at University College London. Subsequently she took a DPhil at the University of York in Anglo-Saxon cemeteries contemporary with the spectacular ship burial at Sutton Hoo.\nAfter university she worked as assistant keeper of archaeology at Norwich Castle Museum before joining the Portable Antiquities Scheme, first as their Finds Liaison Officer for Suffolk and then as Finds Advisor for post-Roman objects, based at Cambridge University. In 2014 she became the PAS's advisor to its voluntary finds recorders, based at the British Museum.\nShe first worked for Time Team in 1998 as a digger, and took part occasionally thereafter as an Anglo-Saxon specialist. She joined the frontline team of presenters for the 2006 series and continued until 2010.\nShe has contributed a number of articles on her specialist field, editing and writing other works. In 2003 she was elected a Fellow of the Society of Antiquaries of London. She is also a regional member of the Council of Rescue: The British Archaeological Trust.\nIn November 2014 it was announced that Geake would contest the Bury St Edmunds constituency for the Green Party at the 2015 General Election.\nGeake is married to Angus Wainwright, the National Trust archaeologist for the East of England, with two sons and a daughter, and lives in Woolpit, Suffolk. She is a cousin of the late John E Geake, for whom the asteroid 9298 Geake is named.", 
        "ns": 0, 
        "pageid": 11189310, 
        "title": "Helen Geake"
    }
}