{
    "first_para": "Jill Fraser is a British politician and tenants activist in London. She was the first ever Liberal Democrat Mayor of the London Borough of Camden, holding the position between 2006 and 2007, and has also represented Haverstock ward on the council since taking the seat from Labour in a by-election in 2003.", 
    "full": {
        "extract": "Jill Fraser is a British politician and tenants activist in London. She was the first ever Liberal Democrat Mayor of the London Borough of Camden, holding the position between 2006 and 2007, and has also represented Haverstock ward on the council since taking the seat from Labour in a by-election in 2003.\nFraser was born in Essex, but has lived in Camden for most of her life. She founded the West Kentish Town Tenants and Residents Association and the Queens Crescent Business Association as well as acting as secretary to the Chalk Farm Business Association and chair to the original Gospel Oak Regeneration Board (GOTCHA). Her children were brought up in Camden, and she has been a Governor at Rhyl Primary School for 18 years. In her day job, she works in a local chip shop in her ward.\nAt the 2005 general election, Fraser stood against Frank Dobson in the Holborn and St Pancras parliamentary constituency, securing an 11% swing to the Liberal Democrats and almost doubling the Liberal Democrat vote. She was unsuccessful in her bid to re-contest the seat for the 2010 general election, coming third out of four candidates for the Lib Dem nomination.\nFraser nevertheless went on to hold her seat on the council in the 2010 local elections but, in common with the swing to Labour across London, with a reduced majority.\nHowever in 2014 she lost her seat back to labour, as the Lib Dem's lost all but one council seat.\nFraser will stand in the 2015 General Election for the Liberal Democrats, contesting the Holborn and St Pancras seat for the second time.\n\n", 
        "ns": 0, 
        "pageid": 8051710, 
        "title": "Jill Fraser (UK politician)"
    }
}