{
    "first_para": "Francie Molloy (Irish: Proinsias Ó Maolmhuaidh; born 16 December 1950) is a Sinn Féin politician who has been the Member of Parliament for Mid Ulster since 2013 and the Member of the Northern Ireland Assembly for Mid Ulster since 1998.", 
    "full": {
        "extract": "Francie Molloy (Irish: Proinsias Ó Maolmhuaidh; born 16 December 1950) is a Sinn Féin politician who has been the Member of Parliament for Mid Ulster since 2013 and the Member of the Northern Ireland Assembly for Mid Ulster since 1998.\nHe first stood for Sinn Féin in Fermanagh and South Tyrone in the 1982 Assembly Elections, finishing sixth in the five-seat constituency. He was then elected to Dungannon council in 1985 representing the Torrent electoral area, centred on Coalisland. He retired from the council in 1989 but was re-elected in 1993 and has been a councillor since then.\nMolloy stood unsuccessfully for Sinn Féin in the European election, 1994.\nMolloy was elected to the Northern Ireland Forum in 1996 representing Mid-Ulster and then for the same constituency to the Northern Ireland Assembly in 1998, 2003 and 2007.\nIn 2005, Molloy was temporarily suspended from Sinn Féin after publicly disagreeing with the party policy on eliminating many district councils, including the Dungannon Council of which he was a member.\nIn December 2012, Molloy was selected as the Sinn Féin candidate for the UK parliamentary constituency of Mid-Ulster, which had been held by his party colleague Martin McGuinness since the 1997 General election. The by election took place on 7 March 2013.\nIn the run-up to the election, media attention focussed on past allegations about Molloy and how they related to the DUP/UUP-supported independent candidate Nigel Lutton - in 2007, DUP MP David Simpson had claimed during a debate in the Westminster parliament that Molloy had been a member of the IRA and was suspected by police of being involved in the fatal shooting of Lutton's father, Frederick 'Eric' Lutton, on 1 May 1979. The IRA had taken responsibility for it on the basis he was an RUC reservist. The investigation came to nothing, and Simpson claimed this was because Molloy was subsequently coerced into becoming a police informant, providing information that helped break up the IRA's East Tyrone brigade. Molloy denied the allegations at the time, and challenged anyone to repeat them outside of Parliament so that he could take legal action (the original speech being subject to parliamentary privilege and thus not actionable).\nThe UUP leader Mike Nesbitt said he had been unaware of the speech and that it had played no part in Lutton's selection. Lutton also denied the claims were behind his decision to stand.", 
        "ns": 0, 
        "pageid": 8971026, 
        "title": "Francie Molloy"
    }
}