{
    "first_para": "Robert Howard Marris (born 8 April 1955) is a British Labour Party politician, who was the Member of Parliament (MP) for Wolverhampton South West from 2001 to 2010.", 
    "full": {
        "extract": "Robert Howard Marris (born 8 April 1955) is a British Labour Party politician, who was the Member of Parliament (MP) for Wolverhampton South West from 2001 to 2010.\nThe son of Dr. Charles Marris and Margaret Marris JP, he was born in Wolverhampton and partially educated in the state system at Warstones Primary School, before attending Birchfield Preparatory School and St. Edward's School in Oxford. He then moved to Canada and spent some time as a lumberjack, before obtaining a double first in History and Sociology from the University of British Columbia. He then completed a Master’s degree, working as a truck driver whilst finishing his thesis. Having decided he wanted a career in law in the UK and not being eligible for a UK grant, he spent 3 years driving trolley buses, followed by a period as a forest fire fighter during which time he joined Greenpeace, newly founded in Vancouver, becoming world member no. 204. Marris believes trade unions give people access to greater opportunities than they could achieve on their own. He served his articles of clerkship in Wolverhampton and went to work for Thompsons the solicitors, whose work he says is 90% Trade Union related, until he was elected to Parliament.\nOn 8 July 2007, he became PPS to The Rt Hon Shaun Woodward, MP Secretary of State for Northern Ireland.\nIn June 2008, Marris was cautioned after causing damage, which he said was unintentional, to a van which was impeding his access to a bus stop. \nIn July 2008, Marris received the coveted \"Backbencher of the Year\" award. Marris has spoken in a \"well above average\" number of parliamentary debates and has a \"well above average\" voting record.\nMarris emerged well from the May 2009 political scandal of MPs expenses disclosures being listed as a \"saint\", with minimal claims for second home.\nHe is Honorary President of the Wolves on Wheels Cycle Campaign.\nIn May 2013 Marris was selected as the Labour Party's Parliamentary candidate for Wolverhampton South West in the 2015 General Election.\n^ a b \"Rob Marris:Political profile\". BBC news. 16 October 2002. Retrieved 27 October 2014. \n^ a b Ros Dodds (October 19, 2000). \"Profile: Rob Marris - Key to a New Political Life\". Birmingham Post. Retrieved 2 November 2014 – via HighBeam Research. (subscription required (help)). \n^ a b \"about Rob\". RobMarris.net. Retrieved 26 October 2014. \n^ Edwards, Richard (4 June 2008). \"Labour MP Rob Marris cautioned for damaging van\". The Daily Telegraph (London). Retrieved 22 May 2010. \n^ Jon Walker (20 June 2008). \"Backbencher of the year Marris really has a mind of his own\". Birmingham Post. Retrieved 26 October 2014. \n^ \"Rob Marris Former MP Wolverhampton South West\". theyworkforyou.com. Retrieved 27 October 2014. \n^ \"MPs' expenses: The saints (Part ii)\". The Daily Telegraph (London). 18 May 2009. Retrieved 22 May 2010.", 
        "ns": 0, 
        "pageid": 434908, 
        "title": "Rob Marris"
    }
}